[
    {
        "comment": [
            {
                "text": "another crucial aspect of the BRI is, is that it connects all of these countries by roads and ports - not just connect it to China. That is essentially what the ancient Silk Road was - a connection between the myriad countries where it ran. It brought prosperity to all. Especially China but not because the 'roads and ports all lead to China' but because it was a gigantic economy even back then",
                "time": "1年前"
            },
            {
                "text": "I like the conclusion: the competition between China and the West to provide infrastructure to developing nations will likely be good for the developing nations. These countries need infrastructure more than they need ideological purity. If big nations want to compete to provide that infrastructure, all the better!",
                "time": "1年前"
            },
            {
                "text": "To my surprise, AJ is indeed capable of shedding a fair spotlight on China in this regard. A lot less like the typical Western media.",
                "time": "1年前"
            },
            {
                "text": "Something I've witnessed in Thailand , a humongous highway structure was being built on a main route heading south from the north east, great round pillars maybe 40mtrs or more high , with equipment like some thing from a thunderbird film , sliding great sections of road , from pillars to pillars , amazing ..",
                "time": "1年前"
            },
            {
                "text": "This is called real reporting about BRI..... unbiased.",
                "time": "1年前"
            },
            {
                "text": "I live in NYC and I can confidently say that infrastructure here and most other cities in the US is crumbling. Why would anyone look at us for infrastructure projects?",
                "time": "1年前"
            },
            {
                "text": "The BRI is an umbrella initiative spanning a multitude of projects designed to promote the flow of goods, investment, and people. The new connections fostered by the BRI could reconfigure relationships, reroute economic activity, and shift power within and between states.",
                "time": "1年前"
            },
            {
                "text": "The host lady is conducting the show in a sound professional manner, throwing ample light on the pros and cons of the Chinese development initiatives covering the African continent to the Gaweder in Pakistan. To help the poor and impoverished nations every single step taken by China is admirable. Poor wants to bring bread on the table.",
                "time": "1年前"
            },
            {
                "text": "This is the only objective report I've found on the BRI. Allow developing countries to make their own decisions. Having China or the West decide for them is merely another type of colonialism.",
                "time": "1年前"
            },
            {
                "text": "I honestly can't see the US or any European nations doing this in any country without China starting First.",
                "time": "1年前"
            },
            {
                "text": "The relief is: Maybe the Developing countries will benefit in this competition",
                "time": "1年前"
            },
            {
                "text": "BRI has evolved into a vision participating nations can achieve together, foster further collaboration between Asia and Europe.",
                "time": "1年前"
            },
            {
                "text": "This was a really great analysis of the Belt & Road Initiative from several perspectives. Thank you!",
                "time": "9个月前"
            },
            {
                "text": "At least the infrastructures are there, and  it is up the people to strive for",
                "time": "1年前"
            },
            {
                "text": "I read that about that Sri Lanka port, the loan was restructured dozens of times before they decide the 99year lease is best option",
                "time": "1年前"
            },
            {
                "text": "Very informative. China’s Belt & Road is of course meant to increase China’s global influence. It comes with conditions but why do we think that IMF and World Bank conditions is any less severe on less developed countries &/or they are not equally prone to corruption?",
                "time": "1年前"
            },
            {
                "text": "Maybe 6 years ago I saw the highway built with Chinese funds in Ethiopia. These massive projects and the will to do them is impressive. America is still doing environmental analysis on the keystone pipeline and mulling it over.",
                "time": "1年前"
            },
            {
                "text": "Comparing China and America... Two of the most technologically advanced super powers; one has thousands of military bases in other poor countries, and one has built thousands of miles roads and homes in other poor countries. I wouldn’t choose more foreigners military bases in my city and staying poor.",
                "time": "1年前"
            },
            {
                "text": "Missing the fact that China also use this project to study health care and diseases along the way so it is not just transportation but for them to learn and be better prepared health care system.",
                "time": "1年前"
            },
            {
                "text": "I loved how unbiased this whole report was!",
                "time": "1年前"
            }
        ],
        "video": "j8zzL2aBo2M"
    }
,
    {
        "comment": [
            {
                "text": ":_rocketship:",
                "time": "1年前"
            },
            {
                "text": "“Hire Chinese workers who ultimately take wages home.” It’s the small things that matter folks",
                "time": "1年前"
            },
            {
                "text": "\"The US decided the port would not be economically viable...\"",
                "time": "1年前"
            },
            {
                "text": "Pakistan owes the world 239 billion dollars, and Chinese money is only 25% of it. Considering that the debt is used to build critical infrastructure, the CPEC project is essential to Pakistan. And why does no one talks about the other 75% debt ",
                "time": "1年前"
            },
            {
                "text": "Very impressive port.",
                "time": "1年前"
            },
            {
                "text": "China gets to use their excess labor, state-owned enterprise capacity, and keep strategic allies indebted to them. The leaders of the target country get to tout achievements and are paid under the table. The general population gets desperately needed infrastructure. It's a win-win-win strategy. I'm not implying China cares about the target country, but why would/should they?",
                "time": "1年前（修改过）"
            },
            {
                "text": "Pakistan PM :\"Our economy now linked to china \"this is the big statement . Pakistan on   the way to srilanka  .",
                "time": "1年前"
            },
            {
                "text": "Idea is to belt Pakistan on the Road. (That's the whole belt and road initiative)",
                "time": "1年前"
            },
            {
                "text": "The freedom of navigation is the primary reason why trade can rely on this for goods to be reliably exchanged globally. Can land route achieved the same kind of freedom of movement? During times of peace, I think it may still be possible but it is still challenging. Without international law governing the freedom of movement of goods via land route, any country can simply impose unilateral border control measures.",
                "time": "1年前"
            },
            {
                "text": "With the kind of leaders pakistan has, and it's never ending dependency to rely on others, it will always remain a stooge of other super powers.",
                "time": "1年前"
            },
            {
                "text": "China building road for themselves and charging the bill for it as loan to Pakistan ",
                "time": "1年前"
            },
            {
                "text": "An interesting analysis, it will be interesting to see how these projects play out in the future. Because regardless of who eventually takes over (if any1), if its a commercial dud then its going to be a problem no matter who the owner is.",
                "time": "1年前"
            },
            {
                "text": "China's Belt&Road project might benefits many cooperating countries, but China needs to provide more transparency of this project, and prove that those countries are really benefiting from this project.",
                "time": "1年前"
            },
            {
                "text": "Hilarious that at ",
                "time": "1年前（修改过）"
            },
            {
                "text": "The main challenge is the slow-paced bureaucracy and lack of transparency within Pakistan.",
                "time": "1年前"
            },
            {
                "text": "An interesting point is that: the Singapore government was supposed to develop the port. However, they just left it there and did nothing. The only purpose is to block other countries to develop it as it would dramatically influence the advantage of Singapore’s location: once APEC is ready, no need to go through Malacca for commodities from China to Europe and Africa.",
                "time": "1年前"
            },
            {
                "text": "To all nations, don't compromise your value.",
                "time": "1年前"
            },
            {
                "text": "so the road is the belt and the sea is the road.",
                "time": "1年前"
            },
            {
                "text": "What ever investment was brought in by US in Pakistan, either in the form of aid or loan etc.... was recollected by the NGO'S and in return there was always do more. Atleast with china there are no strings attached.",
                "time": "1年前"
            },
            {
                "text": "Great video, but no mention of the fact that contractors are asking to be paid in dollar ",
                "time": "1年前"
            }
        ],
        "video": "AU1OvrbawE8"
    }
,
    {
        "comment": [
            {
                "text": "\"Critics argue this will enhance China's geopolitical influence.\"",
                "time": "2年前"
            },
            {
                "text": "The most interesting component is the arctic Silk Road, linking China Russia and Scandinavia",
                "time": "3年前"
            },
            {
                "text": "Best video I watched regarding this topic, very clear and not biased like most western channels.",
                "time": "8个月前"
            },
            {
                "text": "Nice video, simple and accurate. No biased and excessive content.",
                "time": "3年前"
            },
            {
                "text": "Actually, there's a huge geographic benefit since Europe, Africa, and Asia are next to each other, also connected by land. It could be easier to expand trade route and others. ",
                "time": "4年前"
            },
            {
                "text": "Finally we have another superpower. No more 1 country dominates all. Having 2 buyers are better than one.",
                "time": "3年前"
            },
            {
                "text": "Does anyone have any sources for the evidence placed above",
                "time": "3年前"
            },
            {
                "text": "By no means are we (United States) wary of China's growing influence. That's what free enterprise does. In fact, we encourage it and we're not concerned about our standing. We do have concerns about them counterfeiting our products after they steal our technology but we wish china well and all we want is fair trade. No shame in that. Then both countries can grow & prosper.",
                "time": "2年前"
            },
            {
                "text": "Great enterprise.. Love from Bangladesh...",
                "time": "3年前"
            },
            {
                "text": "You may wish to track and trace back to your superiors when and whom plus how the idea came up back in 2012. After being thought up in 2010 by the game Silkroad Online. But among is the idea to end poverty and war in Africa. We thought that war wasn't the way for global economy since everyone wants to profit and benefit. So the obvious solution was to raise the welfare of the continent. Now you know. This message was relayed by authorities and they get the credit. Whereas the original person who came up with the idea is hidden close and tightly wrapped up. Nothing, not a single credit goes to him. In fact, they covered everything up and make sure he looked mentally ill.",
                "time": "3年前（修改过）"
            },
            {
                "text": "this is objective. It’s fact that some  countries are arguing about the BRI since the risk comes with opportunity. While it's a worth game to play",
                "time": "4年前"
            },
            {
                "text": "While I heard the United Kingdom and Germany have signed at the end of last year.",
                "time": "4年前"
            },
            {
                "text": "thank you Mr.Mike",
                "time": "2年前"
            },
            {
                "text": "they are essentially repeating USSR's expansion to sieria and central asia....it ultimately bankrupted them with little to no benefit. the thing about sea is that you can scale up very easily to carry different loads and take different routes. you can't do this with land based transportation, so there is tremendous upfront cost to build infrastructures in countries with little to no benefit to China.",
                "time": "4年前"
            },
            {
                "text": "one ring to rule them all.... one road to make conquest easier.",
                "time": "4年前"
            },
            {
                "text": "Belt to tighten the debt for country under the planning road for $$$ better not join this belt buckle trapped ",
                "time": "3年前"
            },
            {
                "text": "I can’t tell if this video is biased to not, but it seems very neutral",
                "time": "4年前"
            }
        ],
        "video": "8mlIfNoLMaM"
    }
,
    {
        "comment": [
            {
                "text": "I literally laughed at her last statement :\" what started as one belt one road  is now one belt to many road blocks.\" savage Palki.",
                "time": "1年前（修改过）"
            },
            {
                "text": "Amazing news reportage, and Palki is definitely the epitome of how an ideal journalist should be like. Absolutely loved this video and WION's content is always so rich!",
                "time": "1年前"
            },
            {
                "text": "The contents on this channel is amazing. ",
                "time": "1年前"
            },
            {
                "text": "With the monopolization of news and media in the United States, I find such thorough reporting wonderful. By facts over rhetoric I find this both informative and entertaining.",
                "time": "1年前"
            },
            {
                "text": "Never seen such information with plenty of research done by this team. Kudos to you. Keep up the good work.",
                "time": "1年前"
            },
            {
                "text": "\"Power tends to corrupt; absolute power corrupts absolutely\" - Lord Acton",
                "time": "1年前"
            },
            {
                "text": "from Canada: i love your reporting and i thank you for it. you are reinforcing what those of us in the west, despite our education and access to information, refuse to report on or consider what it all means for our collective future.",
                "time": "1年前"
            },
            {
                "text": "Absolutely incredible reporting. I'm so glad to have found this channel!.",
                "time": "1年前"
            },
            {
                "text": "This is what we call journalism. Thanks for the in-depth analysis.",
                "time": "1年前"
            },
            {
                "text": "\"Mrs. Palki Sharma's\" work is needed to be appreciated, within a span of a month, I am able to understand the geopolitics at least around India and in some parts of the world. Thanks to WION and CRUX, optimal and crisp news.",
                "time": "1年前"
            },
            {
                "text": "Why didn't I discovered this news channel earlier?? You guys are doing an amazing job by not putting shit into people's head like most of the mainstream media is doing. Just please stick to it. ",
                "time": "1年前"
            },
            {
                "text": "Bring thi lady(Palki) back in channel @WION, she was the gem of the channel.",
                "time": "2周前"
            },
            {
                "text": "\"One belt, many roadblocks\" Palki you are a 'wordsmith' unparalleled . Excellent reporting as usual.  But you did not mention our human natures. Aggrieved peoples eventually find a way/s to defeat their oppressors. CCP obviously are not historical scholars, look at what happened to the British Empire ; the United States fought and got independence as did Gandhi for India. A model I forsee for the CCP is the Mau Mau rebellion in Kenya - a violent whiplash of emotions directed to the British colonials. There are many more examples of colonial powers being overthrown by their downtrodden subjects. \"To be born free is an accident. To live free a responsibility. To die free is an obligation\" Anonymous.",
                "time": "1年前（修改过）"
            },
            {
                "text": "I love this channel. recently, I started watch this channel. I love the palki mam traditional indian culture and easily speaks English fluency pronounciation charming and understood very easily... It will be very helpful for me... This channel is very much better rather than other news channels....jai hind",
                "time": "1年前"
            },
            {
                "text": "Shockingly Italy was the first European nation to sign on with China. The environmental damage done through these projects is devastating. Please talk about that. Great reporting thank you.",
                "time": "1年前"
            },
            {
                "text": "I can just imagine how proud Palki's parent will be of such an absolute amazing person she became. What a breathe of fresh air watching this channel. Amazing journalism. Keep it up . The world world is watching you now.",
                "time": "8个月前"
            },
            {
                "text": "Your presentations are excellent classes for reporting and a great education for high-school and commerce under-grads. Hats-off Palki and your Gravitas Plus team.",
                "time": "1年前"
            },
            {
                "text": "Very amazing reporting",
                "time": "2周前"
            },
            {
                "text": "This is unbelievably thorough and expansive reporting, just beautiful.",
                "time": "1年前（修改过）"
            },
            {
                "text": "Clarity and factualness in your reports are brilliant",
                "time": "1年前"
            }
        ],
        "video": "Rjx1iuY9D2s"
    }
,
    {
        "comment": [
            {
                "text": "CNBC, please give Xin En some funding, so she can travel around the world like other presenters. It's not fair to her that other presenters can travel but she has to stay in Singapore",
                "time": "3年前"
            },
            {
                "text": "\"Hide Your Strengths and Bite Your Time\" - very wise words for a national leader, who is clearly playing the long game.",
                "time": "3年前"
            },
            {
                "text": "This reminds me of a book I've read called \"Proxima\" by Stephen Baxter. The synopsis of the book is that during the 22nd century, China is the largest economic superpower with the \"Chinese Economic Framework\" foreign policy described in the book. It also takes place in a time where they were the first country to put a man on Mars and have a near monopoly  on the solar system, spanning from Earth's orbit,Mars, the Asteroid Belt,and Jupiter. ",
                "time": "3年前"
            },
            {
                "text": "The US is playing Call of Duty, while China is playing CIVILIZATION",
                "time": "1年前"
            },
            {
                "text": "I think the Belt & Road is a great idea, it’s very important for this project to be transparent for the citizens of the nations involved.",
                "time": "3年前"
            },
            {
                "text": "Building infrastructure is generally good...",
                "time": "3年前"
            },
            {
                "text": "Perhaps China could pursue its military intentions in other ports, but not Hambantota. Sri Lanka specifically negotiated that it was not to be used for military purposes.",
                "time": "3年前"
            },
            {
                "text": "Great reporting. I found the information very informative thus provided in this video.",
                "time": "3年前"
            },
            {
                "text": "I really appreciate this video! This is truly good and truthful!",
                "time": "2年前"
            },
            {
                "text": "A little check and balance is fine, but China is helping their economy in the longer run for sure. It is a win-win, you can't lose on building roads. Roads allow development and trade.",
                "time": "3年前"
            },
            {
                "text": "Anyone know where Xin En Lee went? All her social media has been inactive for a few years. She's such a great host and really enjoy her presentations. Hopes she's doing well ",
                "time": "1年前"
            },
            {
                "text": "Very very well explained",
                "time": "3年前"
            },
            {
                "text": "It is a titanic project and a game changer for the developing countries. ",
                "time": "1年前（修改过）"
            },
            {
                "text": "They learned their lessons very well",
                "time": "3年前"
            },
            {
                "text": "China main goal isn't economy benefits but rather security. If one look closely, the trade network went close by their rivals, not so good relationships countries and other superpower controlled regions. Therefore, what you seeing them doing now is mainly national security on the disguise of economy initiative, they simply want to secure their trade route, just incases the countries around them start to restrict their trades routes.",
                "time": "3年前（修改过）"
            },
            {
                "text": "I believe that time will tell if the benefits outweigh the losses for those countries.",
                "time": "3年前"
            },
            {
                "text": "tweet:  Thanks for delineating in bits and pieces the belt and road initiative programs.",
                "time": "3年前"
            },
            {
                "text": "The Belt and Road is a good project. It talks economy and you build in your own country. Of course the infrastructure is yours and it is good especially so since it is to stimulate the economy of that country which every govt. should do. Take Malaysia for example. Initial resistance has given way to acceptance of the ECRL which is part of the Belt and Road infrastructure in a sense and it opens up the entire East coast of Peninsular Malaysia which can only be better for the country as that part is very underdeveloped and a road would not be as useful as the national expressway in the West, at least for now. A railway complementing the Belt and Road Initiative is therefore a good thing, better than a road as other neighbouring countries are involved too and connecting by rail makes more practical and social economical sense among them. Clearly the Malaysian govt., at first being skeptical now quickly realized that the Belt and Road is a good thing as their PM also now praises it. If the Malaysian govt. is conscious of the cost, it is their internal matter and if they borrow to build to improve their economy then there is nothing bad to be said of the Belt and Road, even if they should borrow from say, China. It would just be enterprise. That's what the AIIB was for.",
                "time": "3年前"
            },
            {
                "text": "Since the general aim for every human on earth is to grow and infrastructure and trade are the primary means for any kind of growth, I find it a net good deal considering all possible pros and cons it could bring to everyone.",
                "time": "3年前"
            },
            {
                "text": "China needs to leverage a long term approach. Trade routes need to be economic to make economic sense.",
                "time": "3年前"
            }
        ],
        "video": "ACbbz0rOv6A"
    }
,
    {
        "comment": [
            {
                "text": "Since 2012, China has made $15 billion worth of infrastructure commitments across central and eastern Europe",
                "time": "4年前"
            },
            {
                "text": "European banks and the IMF refused to give Montenegro a loan, then criticized them for taking the only loan they could get. Good job IMF, really looking out for this small country.",
                "time": "2年前"
            },
            {
                "text": "Montenegro is honestly a hidden gem. Visited this year while road tripping Eastern Europe and we were astounded by the high quality accommodations with amazing ocean views for extremely cheap prices. I'm talking around 100 Euros for a 4 bedroom apartment. Anyways my family plans to invest in Montenegro's tourism sector before it gets eaten up. I absolutely love Montenegro",
                "time": "4年前"
            },
            {
                "text": "In 2004 while staying in Ethiopia, i recall huge infrastructure initiatives. One moment that stands out was an army of Chinese workers (1k+) walking down a highway one morning to their jobs and me thinking to myself this was the beginning of a global shift.",
                "time": "4年前"
            },
            {
                "text": "The truth is : When many of the developing countries want to start to build infrastructure, often the IMF is not willing to lend the money to them. And very often when those countries invite different countries for bidding in their infrastructure projects, the quotes from Japan, US, Germany and the like are way much higher than China. If some genius can give a solution to the leaders of those developing countries how to \"escape\" from this \"trap\" other than asking them to give up the dream to get any decent infrastructure in place for their country and continue to stay under-developed for decades or even centuries, I'm sure the leaders are more than happy to know!",
                "time": "2年前"
            },
            {
                "text": "I've been to Montenegro and it's the most beautiful country in Europe in my opinion. The landscapes are astounding but the prices are pretty high, even higher in some central europe countries because of the tourists and the gdp is lower. But the roads are really hard to build, the terrain is mountainous and difficult. If some sort of amatour was driving the bus i travelled in there would be a high chance I'd been dead. It really sometimes looks like one wrong turn can mean falling down the hill with a whole bus",
                "time": "4年前"
            },
            {
                "text": "China has been expanding their own roads in rural areas and through that, has increased export and allowed the residents to become wealthier.",
                "time": "3年前"
            },
            {
                "text": "I am puzzled by all the negative comments.  Maybe China came to Montenegro with ulterior motives, but 2% interest rate is so low that it could easily be drown out by the inflation.  I am sure that Montenegro would have easily accept a better offer if there is any.  I think Montenegro will be a better place because of the project.",
                "time": "4年前"
            },
            {
                "text": "I heard of this! I had to do a Foreign Policy paper and did Belarus. This project was something I have noticed in my own research, as China is constructing there as well.",
                "time": "4年前"
            },
            {
                "text": "I do feel sympathy for the Chinese workers and engineers working in remote countries and live so remotely in areas that people hardly access. I just felt that they must have a very strong will to work and live their life like that. And they probably didn't even get paid well. Just for this one reason, I would appreciate them.",
                "time": "3年前"
            },
            {
                "text": "As a Romanian I can confirm we NEED that road",
                "time": "1年前"
            },
            {
                "text": "Great video! For people interested in learning more about this sort of thing, I'd reccommend the book \"China's Second Continent\", which is about China (both massive state owned companies and individual Chinese who move seeking their fortune) in Africa.",
                "time": "4年前"
            },
            {
                "text": "\"The only way to avoid the risk is to do nothing\"   I couldn't agree more!",
                "time": "3年前"
            },
            {
                "text": "I wonder what would have been the reaction if the road was being built by a European or American country? So, China is having it's fling, as so many countries have done in the past, let it be, if the work done is for the benefit of the people of the country then we must accept that it is the business of the country and China. An end to the interfering.",
                "time": "4年前"
            },
            {
                "text": "They should promote their tourism more in the UK. I went there last year and it was very nice ....especially the £60 return flights from Manchester. With such cheap flights, this could be a goldmine for the older people. ",
                "time": "4年前"
            },
            {
                "text": "This is truly amazing. At home , the planners have just completed a four year road project on a very short 15 mile lane of highway improvement for one billion dollars. Its a very restricted toll lane just for people with a pre-authorized pass and no commercial vehicles. What a stupid idea for everyone that has been delayed by the construction for years and not been able to use it when finished. These people actually have a plan.",
                "time": "3年前"
            },
            {
                "text": "Without infrastructure poor countries remain in a Poverty Trap of stagnation. ",
                "time": "3年前（修改过）"
            },
            {
                "text": "The Chinese construction companies are amazing. ",
                "time": "4年前（修改过）"
            },
            {
                "text": "4:15",
                "time": "3年前（修改过）"
            },
            {
                "text": "Well.... US came to Iraq and wrecked all the highways but they did not forget to confiscate the oil wells and gave them to their firms .",
                "time": "4年前（修改过）"
            }
        ],
        "video": "d0gk_m0gZ0A"
    }
,
    {
        "comment": [
            {
                "text": "Vox Atlas is a new series looking into the big foreign policy stories shaping the globe, produced by Sam Ellis. Check out the rest of season one of Atlas here – and let us know what stories you want to see: ",
                "time": "4年前"
            },
            {
                "text": "The US is playing Call of Duty, while China is playing CIVILIZATION",
                "time": "2年前"
            },
            {
                "text": "As a Sri Lankan..",
                "time": "2年前（修改过）"
            },
            {
                "text": "As America creates war and battlefields, China creates trade and marketplaces. Each country is exerting their influence differently.",
                "time": "8个月前"
            },
            {
                "text": "The Chinese are achieving what the Soviets couldn't economically speaking.",
                "time": "1年前"
            },
            {
                "text": "Can't hate China for playing the game so well.",
                "time": "3年前"
            },
            {
                "text": "Tbh they are playing it so well and in a very straightforward manner unlike america who just sends troops to any country with oil and create chaos there.",
                "time": "1年前"
            },
            {
                "text": "Imagine if America took half it's military budget and spent it on projects like this at home and with our allies.",
                "time": "4年前"
            },
            {
                "text": "I’m from Malaysia. China has traded with Malaysia for 2000 years. In those years, they have been world’s biggest power many times. Never once they sent troops to this region. In 16th, 17th, 18th centuries, the Portuguese, Dutch and British came, we were colonized by each. The presence of China’s power is welcomed in this region. It provides economic benefits. It also enrich cultural experience in the region. We are not afraid of China being powerful in the region, we welcome the rise of China. China don't export ideology, they don't export chaos.",
                "time": "3年前"
            },
            {
                "text": "I have just visited Sri Lanka. To share some of my experience:",
                "time": "2年前"
            },
            {
                "text": "I am from India, I hope both countries can co-operate together and make Asia great. Again.",
                "time": "10个月前"
            },
            {
                "text": "Informative content paired with stunning visuals. Keep up the great work Vox!",
                "time": "3年前"
            },
            {
                "text": "We have to remember that Japan, South Korea and Taiwan are all American allies, and the US has stationed military bases over there to keep China in check, allowing the US to be top dog. ",
                "time": "1年前"
            },
            {
                "text": "Its all the more remarkable that China is achieving these things without bombing anyone.",
                "time": "4年前（修改过）"
            },
            {
                "text": "You know, even though we might not be on the same political wavelength, it's great to see content of good integrity relative to other mainstream sources. Good job.",
                "time": "2年前（修改过）"
            },
            {
                "text": "I remember last year when China started its own petro-yuan to compete with the petro-dollar....of course all oil prices are valued in US dollars, but I figured our government and media would start ",
                "time": "3年前"
            },
            {
                "text": "In Australia almost everyone already learns Chinese in primary school…",
                "time": "1年前"
            },
            {
                "text": "My experience in studies says, by looking at India's position, it seems like not going to be an easy task for China coz most of Chinese plans goes through India or Indian subcontinent which India wouldn't allow and even not allowing and that should be a concern.",
                "time": "3年前"
            },
            {
                "text": "China's Belt and Road Initiative have been the most ambitious infrastructure project in modern history, that's designed to reroute global trade.",
                "time": "1年前"
            },
            {
                "text": "China is playing the long game pretty well.",
                "time": "4年前"
            }
        ],
        "video": "EvXROXiIpvQ"
    }
,
    {
        "comment": [
            {
                "text": "Kenya is looking good, good work Kenya and China.",
                "time": "4个月前"
            },
            {
                "text": "SGR IS profitable tho. Idk what you mean it will take time to be profitable?",
                "time": "4个月前"
            },
            {
                "text": "United States, ca. 2003: \"Shock and Awe\"",
                "time": "4个月前"
            },
            {
                "text": "Question: why would China want to OWN Kenya ? Your neighbor wants to help you build a new driveway. He says, if you can’t pay, he will help you adjust your mortgage.",
                "time": "2个月前（修改过）"
            },
            {
                "text": "Why in secret if it's such a good deal? It should have been opened for all to see as the future model of all deals involving CCPchina.",
                "time": "4个月前（修改过）"
            },
            {
                "text": "Lookin' good",
                "time": "4个月前"
            },
            {
                "text": "Be more attentive to your B-roll. The guy at ",
                "time": "4个月前"
            },
            {
                "text": "Chinese fund isn't fewer string attached, it has no string attached. It is either have or have not",
                "time": "2个月前"
            },
            {
                "text": "Can't wait for the next video explaining how, in a few years, Kenyan infrastructure would belong to China as the \"trillion dollars investments\" (which are loans actually) haven't been paid up.",
                "time": "4个月前"
            }
        ],
        "video": "jnmWsFaIdj8"
    }
,
    {
        "comment": [
            {
                "text": "Do you think China will continue to develop transportation infrastructure around the globe?",
                "time": "2个月前"
            },
            {
                "text": "I used to spend at least 8hrs on the bus at night going to Mombasa and it was always risky traveling on a two way highway full of trucks. Last year when my family and I visited home we used the SGR. Only $40 for first class, very good customer service with a lot of comfort and the travel time is half of what you would spend in the bus. Hopefully the project expands to other parts of the country. It has made life much easier.",
                "time": "2个月前"
            },
            {
                "text": "As a Kenyan,the SGR has really helped saved time and money while traveling to Mombasa. Buses were always unsafe especially when they broke down. The problem with the railway project is that there is alot of corruption. Our Government want to have a big slice of the cake that is causing issues with the Chinese. I don't blame the Chinese....our government is just too greedy.",
                "time": "2个月前（修改过）"
            },
            {
                "text": "I am an American living in Kenya. Benefits of the SGR go way beyond moving materials back and forth from Mombasa and Nairobi. A lot of people are using it now to commute between Nairobi and Mombasa since it is significantly faster than matatus. Once extended to Kisumu, it will open up potential for mining and farming in the interior hinterlands. Right now, huge amount of food comes from Tanzania mainly due to better infrastructure connecting it. Fish farming in Lake Victoria could become a thing with the right infrastructure to quickly transport from Kisumu to Mombasa and allowing to sell on the global market.",
                "time": "2个月前"
            },
            {
                "text": "Insightful. I hope all turns out well for these projects. It’d be nice to see East Africa prosper even more.",
                "time": "2个月前"
            },
            {
                "text": "To be fair the SGR has positively impacted the movement of passengers along the entire corridor from Msa to Nairobi and vice versa. It is a great alternative to the road.",
                "time": "2个月前"
            },
            {
                "text": "It often takes a long time for projects like this to pay off.  And from what some of the other commenters have shared, it appears to have yielded serendipitous benefits that may improve local life and the economy overall.  Lacking knowledge of the history of great projects, I couldn't say how long it took for the Hoover and Aswan Dams or the Brooklyn or Golden Gate Bridges to 'pay off'.",
                "time": "2个月前"
            },
            {
                "text": "Building transportation is the first step of development.",
                "time": "2个月前"
            },
            {
                "text": "In defense of the SGR railway ... It's has really improved transit btwn the 2 cities and was a huge success ...it may not have been profitable but you can't compare such huge infrastructure that will be there even after the debt had been paid .it's not always about profits it all about long term economic growth. Plus the Imf and world bank never invest their money in infrastructure .",
                "time": "2个月前（修改过）"
            },
            {
                "text": "This story would be more interesting if it mentioned how much cargo needs to be transported to the coast from Nairobi, and whether any company could have built a railroad of the same quality for less.",
                "time": "2个月前"
            },
            {
                "text": "The creation of this property eventually allowed for exchange.",
                "time": "2个月前"
            },
            {
                "text": "long term the rail line will  no doubt be beneficial, it is early to judge, for cargo volumes logistics might be a problem but eventually it will be resolved. Kenya is a very populous country, Nairobi and Mombasa are very big cities, there is great distance and people inbetween them, it just cannot go wrong if it is well managed",
                "time": "2个月前"
            },
            {
                "text": "I visited Kenya to specifically use the SGR. The citizens who use to do a 12hr commute now spend less than 5hrs on the same trip. It costs  $10 which is pretty affordable for the average person. It might be an expensive project, but in the long term it really improves the lives of the Kenyan people.",
                "time": "2个月前"
            },
            {
                "text": "The development of a railway transport system will be advantageous once the mining industrialization throughout Africa comes online",
                "time": "2个月前"
            },
            {
                "text": "The SGR is a good idea only that the section done is too short and captures a very small catchment area or zone.  Had this line gone all the way to DRC and in particular Goma DRC and Kisangani DRC not forgetting it's northern route to Juba south Sudan,  then it would be a viable opportunity to open all sectors including tourism. The opportunity is still there but there was underinvestment in terms of extent of the catchment area.",
                "time": "2个月前（修改过）"
            },
            {
                "text": "It's not even 2 years since it was launched and our negationist friend living far away from Kenya knows more than us that the railway isn't not profitable.",
                "time": "2个月前"
            },
            {
                "text": "Very interesting bit there, George. Thank you very much. China’s high speed rail systems are so rad, one would hope that they are able to share some of this awesome gift they have with other nations too.",
                "time": "1个月前（修改过）"
            },
            {
                "text": "SGR Will expand to Uganda, Congo and Southern Sudan to conquer the region. This is the best thing that ever happened to Kenya. The current problem is due to Politics and change of government but the new government has no choice but to follow up with dept payment. Kenya was amoung the few Countries that benefitted enormesly from China belt and Road project since our economy was ready to expand. Not all countries had the same chance.",
                "time": "2个月前"
            },
            {
                "text": "In my country railways had always been operating at lose but are maintained by the government as part of public service due to the indirect economic value it provides as infrastructure.",
                "time": "1个月前"
            },
            {
                "text": "Kenyans love SGR and use it daily for cargo and passenger services. So far they're making profits which keeps increasing yearly. The only problem is that the train can't go upto Naivasha inland depot since it was shut down by the new president with claims that's it was a waste of money to move cargo away from the port to farther inland but it made it easier for Uganda to get their cargo faster from Kenya",
                "time": "2个月前"
            }
        ],
        "video": "3ALqdqoTYSE"
    }
,
    {
        "comment": [
            {
                "text": "This doc emphasizes the bad impact of China's investment, but from a business point of view, it makes a sound investment.  At the same time, the doc does not mention that the West would not have invested in these countries and that these countries would not be able to withstand the financial and economic burden insisted by IMF.",
                "time": "6个月前（修改过）"
            },
            {
                "text": "Apparently the only theme is to discredit China but we the audience wants an objective view of BRI ‘s impact on the participating countries, no matter bad or good. You can’t reap the benefits without any cost.",
                "time": "9天前"
            },
            {
                "text": "Wish every country on earth to be prosper and wealthy. Everyone deserved what the world can offered at best.",
                "time": "2年前"
            },
            {
                "text": "DW, you're my ticket to great documentaries! It's always a pleasure watching you each time. You never fail.",
                "time": "6个月前"
            },
            {
                "text": "Really sad to see what has happened to Cambodia...  Their politicians horribly failed their citizens!!",
                "time": "2年前"
            },
            {
                "text": "That's what is called a documentary, people! It was a pleasure to watch it.",
                "time": "1年前"
            },
            {
                "text": "As a Chinese, I have been to a lot of communities in both China and America, I felt that, it is hard to stay in bad life in China even you are in bad community as the government force you to chase good life. In America, It is hard to chase good life if you stay in bad community as bad community has freedom to stay in bad life.",
                "time": "3年前"
            },
            {
                "text": "It's also happening here in a lot larger countries. If they can't curb it, smaller countries are in trouble as well. It's so sad to me, makes me feel aweful. Money always talks, no matter where it is in the world. Always has, always will. Again, makes me sad.",
                "time": "3年前"
            },
            {
                "text": "That line of poem actually means “when traveling west of YANG pass, you will see no more old friends”.  It is written to a friend of the poet saying farewell.",
                "time": "3年前"
            },
            {
                "text": "Silk Routes: There were at least 5 different routes that are known as Silk Routes: At least three were most used. Northern China, via Mongolia, Central via Central Asia and Southern via India. The two sub routes were split in Central. Most ended at Anatolia, Turkey. China, then, was the most technically advanced country",
                "time": "1年前"
            },
            {
                "text": "Dunhuang is a very interesting place. I've been there twice and really enjoyed it. The secret is to avoid the massive crowds who hang around the dunes at the entrance to that park, and just enter for free a few hundred metres either side of the gate. If you veer to the right of the gate you'll find yourself in a graveyard with very interesting tombs, and you can walk around there for hours looking.... I recommend an overnight trip to the desert where you will see stars like you'll never see anywhere else in China. Sitting under the night sky by a fire is really an awesome experience, and there will be nobody around (most of the Chinese tourists won't even consider this option). The best part is you see the dunes in all their splendour.....",
                "time": "3年前"
            },
            {
                "text": "Thank you for presenting us another informative documentary which says a lot.",
                "time": "1年前"
            },
            {
                "text": "Hey @DW a little correction here the cemetery shown at ",
                "time": "3年前"
            },
            {
                "text": "We visited KHUNJRAB PASS as a local tourist few years ago but now-a-days many Pakistan tourists and foreigners too used to visit this pass. Yes, casually landsliding incidents happen, but overall its worth a fun. Traveling into Northern Areas of Pakistan is passion now-a-days but on the other side you have showed negative side. Visit this summer and find the reality.",
                "time": "1年前（修改过）"
            },
            {
                "text": "Love the documentaries, reality hits hard...keep up the good work :-) subbed",
                "time": "1年前"
            },
            {
                "text": "Thank you DW Documentary for a fascinating look at this massive project. Vielen Dank.",
                "time": "11个月前（修改过）"
            },
            {
                "text": "one of the best and great documentaries ! hats off DW",
                "time": "2年前"
            },
            {
                "text": "Thank you DW for your excellent documentaries.",
                "time": "11个月前"
            },
            {
                "text": "you should continue this but in south america and other places, great work!",
                "time": "3年前"
            },
            {
                "text": "DW docs is amazing as always. Love their work. Congrats again !",
                "time": "3年前"
            }
        ],
        "video": "cUxw9Re-Z-E"
    }
,
    {
        "comment": [
            {
                "text": "I found this documentary informative, perspective and objective. Indeed China has a vibrant economic initiative in the BRI that could take human ingenuity and economic pluralism to another level. Kudos to the wonderful people behind this project.",
                "time": "4年前"
            },
            {
                "text": "Great Documentary, thanks for visiting Kyrgyzstan - the most open and beautiful country of Central Asia. Hopefully BRI will take off and Kyrgyz people representing IT industry, like myself, are ready to make their own contribution. We, at Kyrgyzstan only wish success to our great neighbor Zhongguo!",
                "time": "4年前"
            },
            {
                "text": "This is lot more realistic way to report BRI than most sensational western media.  This episode is about ‘hope’ in BRI.  Hope to see an episode on ‘risk’ of BRI and one on ‘geopolitical’ implications from the same Professor.",
                "time": "3年前"
            },
            {
                "text": "It is hardly to find in human history who can lead the world to develop such a project like this which can benefit to the world.Many underdeveloped countries in this project are really hope to see it success because there are abundant of educated young generation have the capability but never get opportunity  to deploy their skill.Of cause some countries will fail and some will succeed because of human factor like politic,cultural, rules,regulation differences,these are all human made you can change or not to change it is all in your hand.If you have a better deal then you offer it the whole world is waiting.We no need noise.",
                "time": "4年前"
            },
            {
                "text": "Wow! It's a wonderful documentary. As long as China is \"open\" and there's equitable opportunities, I think BRI or OBOR, is the game changer for Asia, Africa, and Europe.",
                "time": "3年前"
            },
            {
                "text": "Great documentary. Anthony Morse - your conclusions are very true. From a China Studies person - I too agree that Sino-Russian Relations are much more than the usual interstate interactions of hard power or soft power - there is an emotional aspect to it.",
                "time": "2年前"
            },
            {
                "text": "Regardless how some countries interpreted China ambitions China has been influential and beneficial to global economy in many ways.   They are not stopping regardless how hard the US tried to contain them and put any effort to influence the world how bad China is, China marches on without threatening anybody with military might instead China threw in billions of dollars to create this initiative to create prosperity and opportunities for its neighbouring countries. That is impressive. The world needs to look at China in a positive way and join hands to create a better, a more peaceful and cooperative environment for the world.",
                "time": "3年前"
            },
            {
                "text": "I love this. China and the BRI will bring massive progress to many Asian countries. The future for Asia is bright and I hope and believe that this will benefit the world during the next few decades.",
                "time": "4年前（修改过）"
            },
            {
                "text": "Full.of emotions gained from and through watching this.  Dr.May yi Shaw narratives are explicit..",
                "time": "2年前"
            },
            {
                "text": "every country should work together make earth a better place.",
                "time": "3年前"
            },
            {
                "text": "Even if the BRI project partially succeeds, it is a good opportunity for all countries involved.",
                "time": "4年前（修改过）"
            },
            {
                "text": "watching this video until the end is like saying Goodbye to a dear friend, i think this documentary is epic, the stories, sounds, the shooting and such good presentation, wow!",
                "time": "4年前"
            },
            {
                "text": "I think most if not all of the West seem to look at issues and challenges based purely from their view and notwithstanding their supposedly concern for the developing world, they always want their interests to come first; hence their attitude towards BRI. Do note that many of the CIS countries are trying very hard to improve their lot being all LLCs. Likewise the vast central Russian territory is basically under-developed/ With this connectivity, Russia and CIS should be able to contribute to the agricultural produces in the 21st Century. It is sad to note that in spite of all the propaganda on wanting to help others to progress, the West have in reality tried their best to stop this progress. Both China and Russia require this connectivity to develop the sparse regions located between them. Against the current scenario of no business, it is a case of some business; albeit more expensive than other parts of the world; at least business can stand off at the fringes of these nations located around the region. Prepare, the West should think over a longer period rather than the next election!",
                "time": "4年前"
            },
            {
                "text": "I think it has been made to create a political power rather than an economic one since cost of infrastructure projects are very high for underdeveloped countries(Kazakhstan etc.). Even if  BRI are completed, it will be only beneficial for the chinese industry not for other countries. Low cost chinese products will crush potential competitors.",
                "time": "3年前"
            },
            {
                "text": "Very interesting!  But someone needs to work on the subtitles, which are incomprehensible in many places.  I intend to watch this again on a big screen and will recommend it to some of my family and friends.",
                "time": "4年前"
            },
            {
                "text": "We need more people like Jack. ",
                "time": "3年前"
            },
            {
                "text": "We Nepali and Nepal 🇳🇵 fully support BRI . hope it will progress all Asia and beyond. China is Hope",
                "time": "2年前（修改过）"
            },
            {
                "text": "The new silk road is a new way to expand China's export business.  Currently US is the biggest importer of China's export goods, therefore it would be hard to deviate itself from the US dollars but with the new silk road, China is trying to expand it's clienteles away from the US market.  Once it is developed, China will move away from the petro-dollar, which will be the final days of the US printing press.  US will file bankruptcy so fast, the americans won't even know what hit them.",
                "time": "4年前"
            },
            {
                "text": "I think central Asia benefit the most from one belt-one-road because central Asia is pretty much in the center of everything in turn of distance.",
                "time": "4年前（修改过）"
            },
            {
                "text": "Really touch the heart that new inverter from Singapore while he is explaining his true intention to sharing his idea to the future generation, my goodness I can't believe that!",
                "time": "4年前（修改过）"
            }
        ],
        "video": "REtEOS_9Eic"
    }
,
    {
        "comment": [
            {
                "text": "Would love to one day see a freight train running a continuous, unbroken route on standard gauge (1435mm) from China 🇨🇳 to Europe 🇪🇺 either through four rail dual gauge (1435+1520) between Western China and Iran 🇮🇷 or three rail dual gauge through Pakistan 🇵🇰 (1435+1676).",
                "time": "1年前"
            },
            {
                "text": "The most comprehensive description of the Silk roads trains. I love it!",
                "time": "1年前（修改过）"
            },
            {
                "text": "Great video! Looking forward for more international project stuff. Really interesting to see railway transport develop; maybe as time goes on we'll get a high speed line between Europe, Moscow and China, lol. I'd be the first one to hop on a 5 night train to Beijing",
                "time": "2年前"
            },
            {
                "text": "Another great video. Amazing idea. You presented a new perspective of Belt and Road Initiative by explaining role of railways within this initiative. Just keep going!",
                "time": "2年前"
            },
            {
                "text": "Very informative.  Thank you. PS:  China developed a variable gouge train that can cross countries with different railway standards without the need to switch trains.",
                "time": "1年前（修改过）"
            },
            {
                "text": "Silk Road 2.0! Great productions from railway engineering point of view. Keep it up!",
                "time": "2年前"
            },
            {
                "text": "If CO2, SOx and NOx emissions were priced fairly, the marine route would have no chance in competing with electrified Eurasian Land Bridge route.",
                "time": "2年前"
            },
            {
                "text": "Great, detailed and we'll done video!",
                "time": "1年前"
            },
            {
                "text": "Map is not very accurate but this video is still pretty good containing lots of information. It is too bad the track systems are different which seems creating big pain and extra cost. I'd like to see more explanations on this and some discussions about possible solutions. BRI for sure needs all countries buy-ins and it seems a great project that can produce long-term prosperity for all.",
                "time": "1年前"
            },
            {
                "text": "As what latham cole said in the lone ranger movie, who controls the railway has the power, but china does not control all the railway networks. The challenge for china is the collaboration and cooperation between countries for the extensive and efficient use of the networks. As china grows into consumer market economy, the more products will be pumped into china and the more railway will be connected to this network.",
                "time": "2年前"
            },
            {
                "text": "Excellent vidéo well explained and documented. To me it seems almost impossible to have a competitive freight price against Ocean transportation from China to Europe without subside. So, development of Silk Road initiative is intended to increase trading according to China, with countries along all the new routes. It also strategically a way of China to be closer to Europe in case of conflicts !",
                "time": "1年前"
            },
            {
                "text": "I was learning railway (HSR, more specifically) in bachelor, I found it boring and change the major in Master. However, your video is really impressive and inspire some of my curiosity. Thank you for you good work and keep it up.",
                "time": "2年前"
            },
            {
                "text": "We are mainly engaged in railway transportation from Chengdu, Wuhan, Xi'an, China to Europe, Central Asia, Belarus, and Moscow. Of course, we are also looking for long-term partners who can help us transport wood from Minsk or Moscow to China.",
                "time": "2个月前"
            },
            {
                "text": "It would be nice if they included passenger high speed rails along with the freight railways.",
                "time": "1年前（修改过）"
            },
            {
                "text": "The Americans will do every thing in their power to make sure this don't happen. Eurasia railways will spur economic booms from Asia to Europe, America will have no part in this economic boom. China and Eu are two America's biggest rivals, this railway will strengthen two of its biggest rivals.",
                "time": "1年前"
            },
            {
                "text": "Given that Asian countries are rising in economic growth and influence and will likely overtake Europe in the next few decades it is important to establish these links not only for freight but also need to increase in passenger travel aswell despite the many borders that it goes through. It can also lead to much needed development from Eastern Europe to central Asia",
                "time": "6个月前"
            },
            {
                "text": "Good video, but what I missed a bit was an actual price comparison (prices before subsidies) between the different modes of transportation. If unsubsidized railway cargo is substantially more expensive than seaborne cargo, I think the economic viability would be much lower already (at least for the entire route).",
                "time": "2年前"
            },
            {
                "text": "\"The eyes of history are on this appointment.\" - Buttigeig\r",
                "time": "1年前"
            },
            {
                "text": "Un progetto magnifico quello dei Cinesi che bisogna caldeggiare e stimolare. La sua realizzazione sarebbe un colpo da maestro per stimolare l'economia di molti paesi che la ferrovia attraversa.",
                "time": "1年前"
            },
            {
                "text": "Nice one. Enjoyed it ",
                "time": "1年前"
            }
        ],
        "video": "KlfIi6l0hOk"
    }
,
    {
        "comment": [
            {
                "text": "It is  an excellent program, very informative. I have learned a lot about China. I like to have opportunities to listen to similar programs in the future. Thank you.",
                "time": "2年前"
            },
            {
                "text": "Really intelligent, wise interviewee. He makes real sense of China. (I have been watching mainland china from Taiwan for nearly 40 years). He also makes sense of what is happening in Turkey.  Really nice to hear someone you can actually pronounced Beijing properly.",
                "time": "4年前"
            },
            {
                "text": "\" It took China from 1978 to 2001 and beyond to enter the world trade when the U.S. was doing all the blocking until it was not possible any more. Mr. Fingar.\"",
                "time": "3年前（修改过）"
            },
            {
                "text": "Really nice interview. As always, the \"one child policy\" comes up as the big impediment to Chinese future growth.",
                "time": "4年前"
            },
            {
                "text": "Very grounded, balanced and realistic discussion about Chinas BRI and its role in the world. Excellent!",
                "time": "4年前"
            },
            {
                "text": "@",
                "time": "3年前"
            },
            {
                "text": "The building of infrastructure in less developed countries actually seems like a pragmatic move. Chinese companies need it, the Sovereign Countries need it too. The US  has the same goal for the developing countries, hopes that US economic help will enable those countries to develop BUT actually the money is wasted or stolen. The Chinese understand this and just go in and do what must be done. Self-serving? Yes. But their development does indeed bypass the local graft. China understands this. The US is too moral in its expectations. (Naive)",
                "time": "3年前"
            },
            {
                "text": "Simple ideas always work. The countries take the credit loans and China builds it. No cost for China. China doesn’t need the Belt for exports as they are enough already and working fine. The idea is to control the credit and you control the countries. Much like the USA is doing today.",
                "time": "3年前（修改过）"
            },
            {
                "text": "Till 2008 China was very comfortable with parking its Trade surplus in American treasuries. But after the busting of housing boon in USA. America started paying back its Debit by printing Dollars ( Quantum Easing) this got Chinese worried about the value of its treasuries so it came up with a project called OBOR which is essentially lending money to 65 countries to build infrastructure. This infrastructure is build by Chinese companies and opens up new markets for it products. This investment in 65 countries hedges its risk and it gets better interest rate than it is getting for its USA BONDS. The Trillion dollar investment is less than 2 years of its trade surplus, so it can afford it. The political influence it will get is a bonus.",
                "time": "4年前"
            },
            {
                "text": "Dr. Fingar had a lot of trouble to express the belt as one around the world, not just Kazakhstan or Indonesia. While the road stretches not just to Europe, Africa but through out Asia. Even Trump's trade war have different effect on China and US (completely missed by US), that China learns to depend on its talent, developing technology to a higher level (like 'made in China' by 2025), while the US fail to bring back industries out of China and into USA, cannot increase manufacturing (designed to dominate/bully not trade) and thus is stuck with a SMI still hovering where Obama left it.",
                "time": "3年前"
            },
            {
                "text": "China is investing heavily in the one belt,one road for two way trade.China is building bases and the PLAN to protect this trade.",
                "time": "4年前"
            },
            {
                "text": "I wish to add on to Mr Fingar's speech because he had left out some key points (probably because he didn't read Chinese news directly):",
                "time": "4年前（修改过）"
            },
            {
                "text": "The one belt one road program is only the result of the US Naval pressure on China. It's not ambitious and it's too hard to succeed. China's objective is simply expand its market as much as possible when the coastline has been pushed, i.e., the east of China has not much to work on. Japan and Korean and even Taiwan have been closely linked with the US, and Australia, etc. , what else can China expect to do in terms of markets?",
                "time": "4年前"
            },
            {
                "text": "Even if only half of all the belt and road projects succeed, it will still be a huge success for humanity as a whole.",
                "time": "4年前"
            },
            {
                "text": "but having a high-speed railroad or modern ports helps the isolated or less affulent areas  nations to expirt their goods to maje money and import useful stuff or take transactional fees.  There are a very few wrong choice of locations etc, like in Siri Lanca, way off mainatrean area; it shouldn't be used to paint the whole project dark.",
                "time": "3年前"
            },
            {
                "text": "Good analysis",
                "time": "4年前"
            }
        ],
        "video": "7a0CDbUCrS4"
    }
,
    {
        "comment": [
            {
                "text": ">Original Silk Road: Started in 130 BCE",
                "time": "1年前"
            },
            {
                "text": "Wonderful project...",
                "time": "2年前"
            },
            {
                "text": "US is playing call of duty while China is playing CIVILIZATION",
                "time": "2年前"
            },
            {
                "text": "The Chinese strategy is international relations built on mutual respect ",
                "time": "2年前"
            },
            {
                "text": "America has proposed : Only bombs,  No roads.",
                "time": "3年前"
            },
            {
                "text": "I wonder what caused the failure of the old Silk Road?",
                "time": "4个月前"
            },
            {
                "text": "It's the belt and road vs the great reset, the backward green new deal.",
                "time": "1年前"
            },
            {
                "text": "The China is always great. One belt one road initiative project is so great. Huge respect to China 🇨🇳",
                "time": "3年前"
            },
            {
                "text": "Among the several errors in your maps, the East African port for the route should be Mombasa, not Mogadishu.",
                "time": "1年前"
            },
            {
                "text": "5:13",
                "time": "2年前"
            },
            {
                "text": "also pandemic is the best way to kick things off one by one while people r on lockdown.",
                "time": "1年前"
            },
            {
                "text": "Hahah that face and the end",
                "time": "3年前"
            },
            {
                "text": "The USA needs a trade route from Alaska to Chile to Argentina to Brazil the Caribbean through Florida through the rest of the us seaboard to Canada to the UK through western Europe through Africa to west Africa to south Africa back south America. From their to Australia to south east Asia to Japan back to Alaska. The two rings of fire, my idea. Their answer.",
                "time": "2年前（修改过）"
            },
            {
                "text": "Personally, I don't support the progress of the silk road eventhough it helps a lot of countries connect. Putting countries in debt is wrong. Most importantly, the desire of one to control others will be wrong in this situation.  The countries should be focussing on finding the cure for covid-19 so tat every country could get over the pandemic.",
                "time": "1年前（修改过）"
            },
            {
                "text": "They just need new markets for their products. They should explore India/ Indonesia/ Pakistan = almost 2 billions people. Only 3 roads.",
                "time": "2年前（修改过）"
            },
            {
                "text": "This is hilarious.  China really needs to improve its propaganda to make it more believable.",
                "time": "2年前"
            },
            {
                "text": "Now the Silk Road to Europe is giving returns!",
                "time": "1年前"
            },
            {
                "text": "\"Emperor Xu\" of the Han Dynasty with Emperor Guangxu's photography took in Qing Dynasty? What a figure of imagination!",
                "time": "1年前"
            },
            {
                "text": "Hey china I wrote brazil financial infrastructure ",
                "time": "2年前"
            },
            {
                "text": "Can any one on this chat tell me something. So america has no part of this Silk road? No form of integration into this expansion? I no it's on d asian side. But this affects the world does it not? So does China  have another agenda with this Silk road? I will really like if one of u guys can explain to me. Cause you all seem to be well educated on d topic. I am very interested in it. Thank you for any assistance.",
                "time": "1年前"
            }
        ],
        "video": "5IgN88aLRGg"
    }
,
    {
        "comment": [
            {
                "text": "I been following CNA's BRI series for awhile. Its very informative and I really enjoy it. Most countries involved expressed their optimism and are on the up and up. Mongolia's vast barren landscape, education system and extreme temperatures will be its biggest challenge.",
                "time": "3年前"
            },
            {
                "text": "Really enjoyed your interview, photography and the easy flow and balanced way that all the interactions followed.",
                "time": "2年前"
            },
            {
                "text": "this young man tells an amazing story of the hardships people face in Mongolia. Life over there is  a incredible journey of endangerment where only the fittest can survive. Yet, the do it day in and day out.",
                "time": "3年前"
            },
            {
                "text": "What the world needs to do is all countries should be working together to make it a one world to help out each other",
                "time": "3年前"
            },
            {
                "text": "How do you do it? Some of the best reporting. Great job bringing to us more information about Mongolia and its culture than I have learned in 40 years.",
                "time": "3年前"
            },
            {
                "text": "I can watch your documentary a million times and won't get tired. Simply incredible",
                "time": "3年前"
            },
            {
                "text": "As long no countries force their values or beliefs onto other countries, most people would welcome the change. Whatever conflict is are things we don't understand and fear of being forced into this 'inhumane values'",
                "time": "3年前"
            },
            {
                "text": "Your video/ documentary is informative and helpful. Your questions are unbiased and relevant.",
                "time": "2年前"
            },
            {
                "text": "Your Silkroad series is Awesome. Singapore's Journalism standard is very high.",
                "time": "2年前"
            },
            {
                "text": "My view about countries along the Silk Road Initiative, there is always a group of people who insists on building and financing by their own people but they didn't realize that  they should have \"know how, finance and technology\" because for the last 50-60 years, they didn't build anything at all. Observing those bikers with expensive big motorcycles and attires means they are doing pretty well, I suspected Western countries stirred the situation to damage the relationship with China.",
                "time": "2年前"
            },
            {
                "text": "I'm wondering what is happening now, after covid. ",
                "time": "4个月前"
            },
            {
                "text": "Went to Mongolia this year, from what I heard from the more educated locals, on one hand their gov brows money from n working with China, on the other hand, keeps feeding anti- China sentiment amongst ordinary ppl n told them that their problems r caused by the Chinese. Talking about two-faced! My general impression of Mongolia is a nation still very much hold onto their Genghis Khan area glory.",
                "time": "3年前（修改过）"
            },
            {
                "text": "Quite neutral report, not like the west media only report one side story.",
                "time": "3年前（修改过）"
            },
            {
                "text": "Go Mongolia! Your country is beautiful and I love You! Greetings from PORTUGAL",
                "time": "1年前"
            },
            {
                "text": "God Bless Mongolia 🇲🇳",
                "time": "3年前"
            },
            {
                "text": "Very interesting point to blame China and bri for their environmental damage. But it's largely the failure of their environmental policy.",
                "time": "3年前"
            },
            {
                "text": "I like that stories from both side is told. Bravo",
                "time": "3年前"
            },
            {
                "text": "Nice documentary. I watched all from the start, episode 1. One thing I am struggling you to have in your future docus: please flash on screen unfamiliar and local terms (i.e. local names and places). Hope this helps.",
                "time": "2年前"
            },
            {
                "text": "I thought Mongolians had their own script, like in China where Inner Mongolians write Mongolian in a top-down traditional script, you can see it along the characters of the Lingua Franca of China, Mandarin.",
                "time": "3年前（修改过）"
            },
            {
                "text": "This is informative reporting. Western reporting tends to just emphasize on the existence of objectors and corruption, as if that justifies  a negative view of China.",
                "time": "3年前"
            }
        ],
        "video": "Vb2FWlbT1QE"
    }
,
    {
        "comment": [
            {
                "text": "Laos is so beautiful I’d love to visit and experience the culture.",
                "time": "2年前"
            },
            {
                "text": "I do believe that every human beings deserves a better living condition. Every people need roads, bridges, railways, hospitals and school. Good luck to one belt one road initial ! Long life to China-Laos -Vietnam friendship !",
                "time": "4年前"
            },
            {
                "text": "thank you, CNA and  host. As a Chinese lived in Shanghai I don't really know the details about the BRI, and my ignorance even make me feared that we might carelessly disturbing our neighbours. And after watching this documentary, I have learned a lot about the BRI and it's influence from north to south. Most importantly, the narrative angle is focusing on the peoples, their lives and culture. That I think is the same purpose of BRI which is to inspire people and encourage them to improve their lives constantly.",
                "time": "2年前"
            },
            {
                "text": "Love your channel and your effort trying to explain to the westerns the BRI. Its awesome and a brilliant job in my opinion! Thank you very much!",
                "time": "1年前"
            },
            {
                "text": "希望亚洲各国政府和人民能和平共处，共创美好生活！加油亚洲！",
                "time": "4年前"
            },
            {
                "text": "Lao is a beautiful country. Would love to visit some day",
                "time": "3年前"
            },
            {
                "text": "fantastic video! finally have a chance to see with my eyes what it really is like with the new silk road project. Great to see people benefiting from the project, despite challenges lying within and ahead. More cooperation and communication will make the world a better place.",
                "time": "4年前"
            },
            {
                "text": "Yes, I hope so! I truly wish the goodness of prosperity for them all. I'm Filipino & I wish the same for our country Philippines same goodness just like I hope for our neighbouring countries. People deserve improvements & favorable changes!",
                "time": "4年前"
            },
            {
                "text": "What an amazing vision and forward thinking creating this New Silk Road.  I can't think of any country bold enough to try and pull this off with enough resource and capital like China.  I have to commend them for that.  China's goal is to facilitate trade with the world and in the process elevate the poor countries along this belt and road initiatives.    It's a win win for the countries involved.  The debt trap is real and a concern but I don't think China's goal is to create a debt trap for the countries but to connect the world to trade.  I expect a few countries may fail to pay back.   We shall see how that unfolds but I do really like the grand view with the side effect of modernizing many of the countries that will be touched by this forward vision and improving their standard of living.  I truly also want to believe this will help the world as we are all one race Human race.",
                "time": "3年前"
            },
            {
                "text": "It's very wise if the Vietnamese to be cautious in signing massive trade and economic deals with ANY foreign investors, not just China. When another nation has too much financial influence on a nation; the integrity of their political and judicial systems become compromised and can easily result in a foreign government influencing laws, policies and even constitutions.  This takes generations to reverse and potentially the affected country may never fully recover.",
                "time": "3年前"
            },
            {
                "text": "The Belt and Road is more than just opening of the border markets to Southeast Asia. It is the opening up of new markets in land-locked regions of Asia that is the target of most people who invest in the Belt and Road.",
                "time": "4年前"
            },
            {
                "text": "Love to see these two countries  together  for development for the  benefit of  masses of two Great  countries  with historic cherished  memories of their struggle against common adversaries  the Imperialism.",
                "time": "1年前（修改过）"
            },
            {
                "text": "Excellent documentary showing the vision of one belt one road to speed up development in many Asian countries ",
                "time": "3年前"
            },
            {
                "text": "There needs to be more cultural and educational exchange between China and Vietnam. I have heard of more Vietnamese going to study in China but there should also be more Chinese exchange in Vietnam.",
                "time": "4年前"
            },
            {
                "text": "This is the second time that I encountered the Laotian Folk Music Played when Vietnam part of the show is introduced.  Lao Cai must have lots of Lao Thai Dam, Lao Thai Dang, Lao Thai Leuang , and Lao Phu Thai Ethnics.  Their language in the song is 100% Lao and Dien Bien Phu or Meaung Thaen was our original Homeland before we inherited the Khmer Kingdom by way of Jao Fagnum who was raised in the Angkor court and was bestowed a Khmer princess.  Is this why the song \" Oh young handsome phuthai bachelor Euy...\"  music is played in the introduction? Did the producers not know that it's a Lao music?  The last time was on Anthony Bourdain's last Vietnamese show.  55555!  Is this why it is called \"Lao Cai\" or in Lao, it means \"Lao far away or Near Lao or Lao egg or Lao chicken\"?  55555!",
                "time": "4年前（修改过）"
            },
            {
                "text": "I like this narrator here,  his voice, speech, articulation on describing and delivering details of his Subject  topic is very persuasive.  No interruption, nor advertisement.  He interact with people when he seems neccessary in his term.   That's the way to control what you  want to deliver in regards to the  information you to want convey.   The Subject \"Silk Road\" fit your Voice.   Thank you Sir, keep up the Exellent work that you are doing.",
                "time": "3个月前（修改过）"
            },
            {
                "text": "Laos is so beautiful ! I hope it stays that way despite modernization which always come with pollution and natural resources depletion!",
                "time": "3年前"
            },
            {
                "text": "As an Oversea Chinese I am concerned about the strain on race relations caused by this. Amy Chua's book, World on Fire described this.",
                "time": "2年前"
            },
            {
                "text": "All I want to see in my lifetime is Africa, Southeast Asia and Latin America reach their potential and return to the greatness they knew before colonization and imperialism ",
                "time": "1年前（修改过）"
            },
            {
                "text": "Excellent! The most informative, insightful and creative program on the BRI that I have ever seen.Good work.Thank you.",
                "time": "3个月前"
            }
        ],
        "video": "D2mUa8VavDc"
    }
,
    {
        "comment": [
            {
                "text": "I'm 43 years old single father living in Hamburg. I'm hoping to retire at 50 if things keep going well for me. Bought my first house last month and I can't be more proud than I am right now. I'm so glad made great decisions that changed me forever. Many thanks to my financial Sir Bobby Harris with his help I have achieved all of this",
                "time": "2周前"
            },
            {
                "text": "Having lived through the years before China opened to the world in early 1980s,  educated in the West and now living in China, I think the US failed to understand that China now has a governance system that is not based on ideology, but a system driven by targets, especially economic targets. It is absurd in China if you argue if the country is a communist or capitalist.  Improving living standard is in everyone's mind.  To Chinese people, the US is now probably more ideologically based.  The misunderstanding of China actually put the US in disadvantages.",
                "time": "1年前"
            },
            {
                "text": "USA: \"We are wholeheartedly against authoritarian regime.\"",
                "time": "1年前（修改过）"
            },
            {
                "text": "US is trying everything to thwart China's development, but forget to work on its own problems. Democracy is only the means, not the purpose. The purpose should be making people's lives better.",
                "time": "1年前"
            },
            {
                "text": "It's not about autocracy or democracy, it's about effective governing.",
                "time": "1年前"
            },
            {
                "text": "It's amazing how little Bloomberg understands China.",
                "time": "1年前"
            },
            {
                "text": "As a Singaporean who lived in Australia, its not that the West is failing. But certainly when crisis arise Chinese people solve it with brutal efficiency while Westerners become armchair philosophers to debate human rights and governmental systems.",
                "time": "1年前"
            },
            {
                "text": "I am from South East Asia. I have American friends who said America is control by Wall Street and MIC ( Military Industrial Complex like Boeing, Northrop, Lockheed-Martin, Honeycomb, etc ) and neglected the middle class and the poor while focusing on the rich. After this video, l think my American friends are right.",
                "time": "1年前（修改过）"
            },
            {
                "text": "Every country should give priority to solving domestic problems, economy, employment, security, and equality. But the West is accustomed to criticizing and blaming others first, and there are still more their own problems than others",
                "time": "1年前"
            },
            {
                "text": "I really agree with this",
                "time": "13天前"
            },
            {
                "text": "I was in China once. It seemed to me they are rising through their own hard work. I may be wrong though, but i doubt it.",
                "time": "1年前"
            },
            {
                "text": "Everything described as “autocratic” in this video aptly applies to the US far better and more conclusively than China.",
                "time": "8个月前"
            },
            {
                "text": "It's about time the mainstream is talking about China how it should be talked about. China is not trying to destroy America itself, China is sitting back and letting America destroy itself. ",
                "time": "1年前"
            },
            {
                "text": "As an Indian Singaporean diplomat once said: China is a 5,000 year old civilization, the US is a 250 year old state. Yet somehow the Americans think they can force the Chinese to adhere to the American model.",
                "time": "1年前"
            },
            {
                "text": "When two empires go to war, it’s got nothing to do with ideology. It’s simply down to spheres of influence or simply put, who holds the most power.",
                "time": "1年前"
            },
            {
                "text": "The wisdom of the Chinese people is not just material rational civilization. Wisdom in culture and art is also worthy of admiration and learning. Compared with many hegemonic countries, he prefers to enhance his competitiveness and do his own thing well, so that his perseverance is in the world of civilization.",
                "time": "1年前"
            },
            {
                "text": "He mentioned Australia, New Zealand, South Korea and Singapore - all countries are basically islands (including South Korea because the border with North Korea isnt crossed at all). And you can handle pandemic much better when you are an island than an inland country. Oh, btw Brazil, UK and other countries in the EU are democracies and look how they failed.",
                "time": "1年前"
            },
            {
                "text": "Whatever you say China being an oppressive, authoritarian regime, or one that is only boasting successes and concealing failures, it won’t change the fact China remains the top-most country most trusted by its own nationals. Its approval ratings > 90% is envied by all its western counterparts. The dramatic growth of its economy in the last 4 decades, making its the 2nd largest economy after the USA. Its ascension to the middle-income bracket while lifting nearly 800 million people from poverty. Its success in beating the covid-19 pandemic with the lowest infection and death rates among major economies. Advancements in 5G/6G, quantum computing/telecommunication, space exploration, Beidou navigational system, etc, all of which are making China one of the most competitive countries.",
                "time": "9个月前"
            },
            {
                "text": "One thing that I have learnt recently is to never be invested on another person/party failure. It can make you do despicable things.",
                "time": "1年前（修改过）"
            },
            {
                "text": "One of the things I hear that’s commonly repeated by western media is how the cultural revolution and agriculture reforms were an economic failure for China. While if you are judging from the economic perspective, that is true. But, that is where the point is missed. The point of the reforms weren’t to make China rich at the time, it was to change the culture of bourgeoisie and elitism to “re-set” the nation together so it wouldn’t grow apart, so people were United in mind, spirit, and actions. Money wasn’t on their mind, because that wasn’t important for the whole at the time. It was not about the individual but creating a new culture. This wasn’t just communism that caused this but they were searching for this new culture since the early 1900s with the decline of the Qing Dynasty, and inability of the old system from protecting Chinese peoples and lands. It’s hard to interpret another system if you don’t understand the history and context. Every analysis I hear from the west is from the Western perspective and applying western understandings and their own beliefs onto China. That in itself is a fallacy. If you are a plumber and judging everything like a broken window from the plumbing perspective you are not getting the whole picture and misconstruing facts to fit into your own narrative.",
                "time": "1年前"
            }
        ],
        "video": "DXVg0Wmn4ts"
    }
,
    {
        "comment": [
            {
                "text": "Where would we be without such documentaries like this one, that shed light on the fuzzy issues for the benefit of the ordinary people?  Thank you, DW, please keep on your noble mission of searching for the truth and enlightening us!",
                "time": "1个月前"
            },
            {
                "text": "Whilst there are questionable practices and a lack of standards, it's better to do some positive than none.",
                "time": "13天前"
            },
            {
                "text": "I'm glad that such big media platform is not afraid to speak about it. Make all the effort to research such issues!",
                "time": "1个月前"
            },
            {
                "text": "I'm glad there are some journalists asking these questions and showing some of the reality on the ground. It's easy for politicians to make grand promises just to get elected. And take our tax money without showing where it really goes.",
                "time": "1个月前"
            },
            {
                "text": "Fantastic journal coverage ",
                "time": "1个月前"
            },
            {
                "text": "Kudos to all oxygen suppliers and carbon reducers. Also Thanks a lot DW Documentary. This is most helpful in raising our awareness ",
                "time": "11天前"
            },
            {
                "text": "Truth and accuracy, science and accountability, that is what we need from Corporations that continue to profit from false publicity, from the back of low paying wages and complicity from Governments officials. Thank you DW for showing how this \"green label\" should really be used (not bought !)",
                "time": "1个月前"
            },
            {
                "text": "using petrol to plant a tree, now that's what I call efficiency",
                "time": "1个月前"
            },
            {
                "text": "Humanity is a heat engine, no matter how you slice it.",
                "time": "12天前"
            },
            {
                "text": "Very happy seeing such initiatives… it’s all for Mother Nature.",
                "time": "1个月前"
            },
            {
                "text": "Yes \"Greenwashing\" is a sleazy tactic used more and more by these sleazy, tax-deferring, corporations. Thx DW!!! We all need to understand that not everything is as it appears. ",
                "time": "1个月前（修改过）"
            },
            {
                "text": "I used to believe in all these... Climate neutral , Fair Trade and everything organic marked..",
                "time": "1个月前"
            },
            {
                "text": "Climate neutrality is now an impossible dream, after the Ukraine war. Germany is refiring coal power plants. New Zealand pushed its climate neutrality target from 2025 to 2050. If rich developed countries with resources can't do it, why expect developing countries with much greater basic needs to comply?",
                "time": "1个月前（修改过）"
            },
            {
                "text": "Wouldn’t it be much more effective to at least partly grow hemp instead of planting trees in temperate regions? Hemp can be used immediately as a source for paper, building materials (hempcrete), textile, etc. CO2 is sequestered from day 1, instead of after 8 years onwards. It also much more flexible. The amount of CO2 sequestration is the same, if not more, than that of the beeches and softwoods in the documentary.",
                "time": "1个月前（修改过）"
            },
            {
                "text": "It's concerning that there are no government regulations for carbon reduction in almost all countries in the world.",
                "time": "1个月前"
            },
            {
                "text": "People who plant trees should be awarded and highly respected",
                "time": "1个月前"
            },
            {
                "text": "Why are there no legal requirements for companies to offset their emissions?I would have thought that is it vital for governments to make this sort of thing compulsory.Anyway,I'll be taking a much closer look at the viability of carbon offsetting and trying to  hold companies accountable thanks to this informative ",
                "time": "1个月前（修改过）"
            },
            {
                "text": "Corporations are all about carbon offsetting because it sounds good, just like the video says. But more important is finding ways to outfight reduce carbon emissions outright.",
                "time": "1个月前"
            },
            {
                "text": "Another great documentary by DW regarding climate change.Keep it up ",
                "time": "1个月前"
            },
            {
                "text": "“Reduced Climate Impact” would be a more appropriate product label.   Still how it’s defined matters.",
                "time": "1个月前（修改过）"
            }
        ],
        "video": "hx6wFq9B-BM"
    }
,
    {
        "comment": [
            {
                "text": "I think it's very impressive to construct these buildings both for China and Egypt. I hope at the same time these buildings are being put up, the necessary infrastructure is also  being done environmentally.  Water, sewage, green energy can not be neglected.",
                "time": "5个月前"
            },
            {
                "text": "The problem with such new capitals is often that they appear lifeless like Nur-Sultan in Kazahstan or Brasilia for example. The thing is that creating a couple building is not enough to attract people. You may create buildings but that doesn't nesceccary creart jobs.",
                "time": "5个月前"
            },
            {
                "text": "It's impressive that there are many critical arm chair experts on how Egypt's developments should be done -",
                "time": "5个月前（修改过）"
            },
            {
                "text": "People who say that it will be a ghost city. Please come to Egypt and tour the dozens of new cities that have been established during the past few decades. You will be surprised by the extent of crowding of these cities and the extent of the success of these projects and the movement of residents from old areas to modern areas where all the necessities of life are found.",
                "time": "4个月前"
            },
            {
                "text": "Still wondering how will these skyscrapers could boost Egypt economy and the Egyptians' quality of life directly? ",
                "time": "5个月前"
            },
            {
                "text": "This belt and road initiative is massive. Spread all across continents.",
                "time": "4个月前"
            },
            {
                "text": "But the real concern is, can desert cities sustain itself with limited water as climate goes batshit from day to day though",
                "time": "5个月前（修改过）"
            },
            {
                "text": "its very impressive and very needed hopefully there will be more added on to this expanding the city further",
                "time": "1个月前"
            },
            {
                "text": "As a Chinese, I think than the new capital of Egypt, Egypt to introduce more photovoltaic industry, increase the power of solar power should be more important, because with the increasing efficiency of solar energy, the cost is getting lower and lower, the cost of solar power in China's domestic solar power has solved the traditional coal-fired power stations, and Egypt has a large number of unoccupied desert areas, and sufficient sunshine hours, if we can use this clean energy to obtain a steady stream of electricity, not only can be used to desalinate sea water to develop agriculture, but also solve the domestic electricity problem and reduce carbon emissions.",
                "time": "5个月前"
            },
            {
                "text": "Egypt is one of the highest at risk to default on debt ",
                "time": "5个月前"
            },
            {
                "text": "I always loved the way China designed their cites. Very walking friendly. Unfortunately everyone I know who visits Egypt says nothing but bad things about the place so it's unlikely I'll ever go to this place.",
                "time": "5个月前"
            },
            {
                "text": "i still don’t understand why everyone is hating on this life changing project when it could literally provide egyptians with many job opportunities, not to mention how almost all the gulf countries have skyscrapers so why can’t egypt have them too?",
                "time": "5个月前"
            },
            {
                "text": "The new capital is not like in the middle of Sahara, it's merely 40 miles away from the Nile river. China has the best hydraulic engineering capability. For example, the South-To-North project solves the water shortage problem for tens of millions. Water and other infrastructures wouldn't be obstacles whatsoever.",
                "time": "5个月前（修改过）"
            },
            {
                "text": "Even $50bn is not expensive for such an enormous project.",
                "time": "5个月前"
            },
            {
                "text": "The Egyptian military is the government and owns a large share of the country's economy and wealth. Egypt serves the Egyptian military not the opposite.",
                "time": "5个月前"
            },
            {
                "text": "I think we are at a point in time where building new cities is no longer a solution. It is actually the worst idea... if it has to be done then use thermal mass such as clay not concrete and glass, it is going to be like a furnace in that city and let's face it the reason for high energy use is from NOT implementing such passive technologies",
                "time": "5个月前（修改过）"
            },
            {
                "text": "Africa is the large markets with rapid economic growth. It have a bright future in the global economy. China's attraction to natural resource-rich countries is no different from western investment.",
                "time": "5个月前"
            },
            {
                "text": "I expect intensive scruntiny & detailed design would have gone into how people in the city will survive and thrive in such a large project. Would like to see more details though.",
                "time": "4个月前（修改过）"
            },
            {
                "text": "Two of the most ancient countries of mankind working together in truly ",
                "time": "5个月前"
            },
            {
                "text": "The Chinese threat theory is only popular under the narrative logic of developed countries. In fact, for most countries, China just provides another option, which is expected to break the developed national interest transmission chain, so it is regarded as a threat.",
                "time": "4个月前"
            }
        ],
        "video": "vU1XiSfj4RU"
    }
,
    {
        "comment": [
            {
                "text": "am so glad I came across you May my god continue to bless you ",
                "time": "7个月前"
            },
            {
                "text": "I DON'T LIKE PUTIN BUT I DON'T LIKE BEING LIED TO ABOUT UKRAINE MORE !",
                "time": "7个月前"
            },
            {
                "text": "If you do not respect your enemy, you will never defeat your enemy. The belt and road initiative from China is clever. All countries need infrastructure and it's a great way to nation build. Perhaps we can learn a few lessons from their initiative. After all, the way we nation build no longer works and we will need to evolve.",
                "time": "7个月前"
            },
            {
                "text": "Why did we give Ukraine $40 billion when our own country is falling apart??? It's a disgrace.",
                "time": "7个月前"
            },
            {
                "text": "OBOR is the biggest infrastructure project in the history of mankind. No wonder the Chinese are powering and building it.",
                "time": "7个月前（修改过）"
            },
            {
                "text": "Thanks Joe for making China Russia Iran North Korea Syria and Venezuela great again",
                "time": "7个月前"
            },
            {
                "text": "Turkey leader just concerned if Finland and Sweden join NATO..it will bring more sharpen situation in EU as right now, Ukraine conflict with Russia is still going on. China BRI interest more lower fees than IMF or World Bank ..that’s why many Asia , Africa and other third world countries join with China’s BRI system. ",
                "time": "7个月前"
            },
            {
                "text": "It seems that Turkey is going to prepare a deal. Turkey enters EU and Turkey will not oppose the entry of Finland and Sweden into Nato. This looks like a poor joke. It remains to be seen if it is one. It has been said many times that Europe would be the big looser of the ukrainian crisis. This is just one more nail in the coffin.",
                "time": "7个月前"
            },
            {
                "text": "Should we keep lying to young  people because of pride thats got us in REVERSE",
                "time": "7个月前"
            },
            {
                "text": "If the USA starts to build seawater desalination plants that can give us extremely cheap renewable green energy while desalinating 300,000,000 gallons of seawater into 300,000,000 gallons of freshwater every day, while creating extremely cheap renewable green energy at 7,500 Megawatts of electricity ever hour, 24 hours a day, 7 days a week and 365 days a year and they’re shielded from solar flares and nuclear pulse weapons, which adds to America’s security. We get electricity at prices so cheap, the power companies can resale it to their customers for half of what they paid in 2021! I don’t know about you, but to me, but why must we throw tens of trillions into the lefts global climate change and global warming’s bottomless pit! They scream about rising seas, yet they have never done anything, that addressed them! To me, that tells me, they are blinded and can’t even do a thing in their 52 plus year War on global warming and climate change?????? Are they stupid, or just nuts?",
                "time": "7个月前"
            },
            {
                "text": "The U.S. could easily stop all of this, just get Biden involved and everything goes haywire.",
                "time": "7个月前"
            },
            {
                "text": "The ukranians and the yanks made their bed they can lay in it.",
                "time": "7个月前"
            },
            {
                "text": "We do not all love ukrainians, some of us know the truth",
                "time": "7个月前"
            },
            {
                "text": "We will never be the world's largest trade partner again until we start manufacturing stuff again. I mean, what do we actually have to offer to the rest of the world? Software and produce?",
                "time": "7个月前（修改过）"
            },
            {
                "text": "They should put a book out there called the Power of Christ And How He Kept His Promise.",
                "time": "7个月前"
            },
            {
                "text": "I am not in awe of what Ukraine has done in this conflict.  Their country appears to be in tatters and they received tons of outside help. Thats not amazing.",
                "time": "7个月前"
            },
            {
                "text": "Belts and roads can be very important.",
                "time": "7个月前"
            },
            {
                "text": "The Earth is the Lord's the fullness thereof and they who dwell therein..",
                "time": "7个月前（修改过）"
            },
            {
                "text": "As Indonesian president said to USA, you are welcome to invest too.",
                "time": "7个月前"
            },
            {
                "text": "I just can't help but to angrily shake my fists at China!!! This is rideculous!!!!!!",
                "time": "7个月前"
            }
        ],
        "video": "okI5Z4Nu0-U"
    }
,
    {
        "comment": [
            {
                "text": "This is one of the best summaries of the BRI that I have seen on YouTube so far.  I hope this one gets around and helps people understand what China's motives are when they come offering money and help.  Like a trojan horse, the deals are loaded with dangerous fine print traps.  Every one of those poor countries who fell for the Belt an Road Initiative will pay and pay, slowing down their progress for the future. Great work, Mint!",
                "time": "2个月前"
            },
            {
                "text": "The best alternative is the BRI . Genius & wisdom !",
                "time": "2个月前"
            },
            {
                "text": "Through BRI, China also developed a highway connecting Phnom Penh to Sihanoukville in Cambodia which reduced travel time from 6 hours to 1.5 hours. Glory to the next superpower!",
                "time": "1个月前"
            },
            {
                "text": "It is fairly common senses, no body will give you anything FREE, there is always some form of",
                "time": "2个月前"
            },
            {
                "text": "Good....",
                "time": "2个月前"
            },
            {
                "text": "You can conquer a nation 2 ways 1. By sword 2. By debt. US president words.",
                "time": "2个月前"
            },
            {
                "text": "hello reporter ,be honest  not talking in half truth,the year 2020 is covid year most investment had slowed down during covid years",
                "time": "2个月前"
            },
            {
                "text": "Why would you say that ",
                "time": "2个月前"
            },
            {
                "text": "Mint: Your lies are your chain! Enjoy!",
                "time": "2个月前"
            },
            {
                "text": "The background music is off putting",
                "time": "2个月前"
            },
            {
                "text": "Please  please close yr gap. Kindly view at a more positive lens instead of spewing toxic rethrotic of China's $$$ Trillion failure. Isn't belt n road beneficial to people n country for connectivity n promote access to trade n industries particularly to developing Countries ? Do U not think China's mission is on shared prosperity where she put her words where her mouth is ? ",
                "time": "2个月前"
            },
            {
                "text": "Sir, are you speaking Indian? Or a combination of English and Indian? It sounds like you are chewing something.",
                "time": "2个月前"
            },
            {
                "text": "Endians forever jealous of China's Success..Gwadar port will be another  jewel of the gulf in  of commerce and trade",
                "time": "2个月前"
            },
            {
                "text": "High inerest rate? Indian jealousy really have no limit",
                "time": "2个月前"
            },
            {
                "text": "No",
                "time": "2个月前"
            },
            {
                "text": "The more india talk, the more it exposes  pure jealousy.",
                "time": "2个月前"
            },
            {
                "text": "Bulls**t",
                "time": "2个月前"
            }
        ],
        "video": "ZFrJsK29F_E"
    }
,
    {
        "comment": [
            {
                "text": "To think that china is doing this alone while West need for a collective effort to make it happen is insane",
                "time": "5个月前"
            },
            {
                "text": "\"We are rapidly approaching an era where people vs government becomes a worldwide phenomenon.\" ~ John McAfee",
                "time": "5个月前"
            },
            {
                "text": "Nobody can become financially successful over night. They put in background work but we tend to see the finished part. Fear is a dangerous component, hindering us from taking bold steps we need in other to reach our goals",
                "time": "5个月前"
            },
            {
                "text": "The G7’s new initiative is called “MELT and GOAD”.",
                "time": "5个月前"
            },
            {
                "text": "When you examine the finances of the G7, you realize these are the countries that have been printing their currencies so much, they are all financially bankrupt.",
                "time": "5个月前"
            },
            {
                "text": "Let's remember this group of people and hold them accountable at the time they will appear on History books ",
                "time": "5个月前"
            },
            {
                "text": "\"We are here to help you, not because we wanna help you, but because we are competing against China.\"",
                "time": "5个月前"
            },
            {
                "text": "\"It's no longer possible for the US to expect the whole World to dance to their tune\" From Most The World With Love.",
                "time": "5个月前"
            },
            {
                "text": "Europe's G7 plan is just a wishful and vague idea that it will be able to counter China's Belt and Road initiative while in reality Europe remains dependent. 45/100 on exporting goods from China. Nation\r",
                "time": "5个月前（修改过）"
            },
            {
                "text": "We are living in a very complicated error where it's getting more difficult to trick the masses",
                "time": "5个月前"
            },
            {
                "text": "One man is playing against 6 people in a chess game. They all have been making their moves in the game until the man makes one move. From the one move the man made, all 6 people  are having trouble making their next move. Anyways, China and Russia show respect to all the countries they are  partnering with. No interferences in the domestic affairs of those countries. No bullying, no threats of sanctions, no boycotting, etc..... Every country is given a seat at the table to discuss the needs of their respective countries. That is how it should be.",
                "time": "5个月前（修改过）"
            },
            {
                "text": "China's B&RI is a national long term strategy to connect to other countries for economic ties...bringing prosperity to China and other countries.  Whereas the G7's plan is to counter China's success, it will fail like the sanctions against Russia.  Also, I would be cautious about putting money in G7's plan.  One of them may freeze the fund at any moment and find a reason to keep it for himself...",
                "time": "5个月前"
            },
            {
                "text": "7 leaders around a table  mocking a man that's taking city",
                "time": "5个月前"
            },
            {
                "text": "3:16",
                "time": "5个月前"
            },
            {
                "text": "funny how the G7 have realized that helping poor countries might be worthwhile but not for good motives, only to try counter China who`s good intentions to grow global prosperity leads the way. Pity not 1 dollar for India.",
                "time": "5个月前"
            },
            {
                "text": "Misnomer: All the G7 are financially bankrupt those that know, know all the moves they can only make. When Rome could not feed or arm or pay  its soldiers what happened.",
                "time": "5个月前"
            },
            {
                "text": "At least Putin could ride a Horse but Biden can’t even handle a Bicycle ",
                "time": "5个月前（修改过）"
            },
            {
                "text": "when your enemies can't beat u,the only thing they can do is mocking.",
                "time": "5个月前（修改过）"
            },
            {
                "text": "Biden is nearly senile, Trudeau has trouble explaining where he drinks his water from, Boris can't even fix his hair and without a script all he can think of is Peppa Pig's world... and this people think they can \"build back better\"",
                "time": "5个月前"
            },
            {
                "text": "Really meaningful to hear WION updates.. ",
                "time": "5个月前"
            }
        ],
        "video": "nFh3T0aLPxI"
    }
,
    {
        "comment": [
            {
                "text": "Wow.... an eye opener. What most people do not know about, till it’s too late. Keep providing the knowledge and sharing !",
                "time": "2年前"
            },
            {
                "text": "your channel can give competition to other big geeks !! your channel has maintaining a standard in your video!! keep it up!!",
                "time": "2年前"
            },
            {
                "text": "Really underrated channel. Better content than some larger channels.  But The music in the background though is really not fitting and degrades the focus of the watcher to the videos content.",
                "time": "2年前（修改过）"
            },
            {
                "text": "I get all informations for my assignments through out your video.... thanks a lot. Great job.keep it up. And you have also get the correct informations. ",
                "time": "1年前"
            },
            {
                "text": "\"cHinA isN't a sUpEr pOwER YeT\" USA people in denial",
                "time": "2年前"
            },
            {
                "text": "Pireaus, the main port of Greece, is not 100% Chinese-owned. It's 67%.",
                "time": "2年前"
            },
            {
                "text": "Staying free and open is a good idea, road safety and electric transport need to be perfected and implemented to reduce or prevent accidents on bridges or in tunnels. Let's all strive towards improving the world and making it safer for both humans and animals, without any depth traps! Money used to improve the world is healthy, money used to create depths is the core route towards greed, overflowing towards evil!",
                "time": "1年前"
            },
            {
                "text": "Just started watching you today, very interesting quality content!",
                "time": "2年前"
            },
            {
                "text": "Awesome video, as always.  ",
                "time": "2年前"
            },
            {
                "text": "And in the future this video will be studied in the schools to understand the antecedents for the Sino-American war.",
                "time": "1年前"
            },
            {
                "text": "wow wow...what a informative video..thanks man ...ur level is same as vox and other channel videos...or more better ...great..new subscriber from india..keep sharing insights ..thanks",
                "time": "2年前"
            },
            {
                "text": "Great work man, so many animations in a longer video, quiet impressive.",
                "time": "2年前"
            },
            {
                "text": "Thank you for this content! On my journey to learning so much more",
                "time": "2年前"
            },
            {
                "text": "It's hard to say I like the video when the content is scary to think about! However, it was good information to know. ",
                "time": "2年前"
            },
            {
                "text": "when China is developing something the environment becomes very important issue",
                "time": "1年前"
            },
            {
                "text": "Thank you for these precious information",
                "time": "2年前"
            },
            {
                "text": "For a channel that has 4K Sub in June 2020 your video’s are really well made ",
                "time": "2年前（修改过）"
            },
            {
                "text": "The CPC has well over 80% support from the people according to Harvard and has been increasing in addition to the one of the very few countries that still has a positive GDP growth along with slowing the spread of the virus. While Americans have spread it all over the country with no real measure to stop.",
                "time": "2年前"
            },
            {
                "text": "I started to watch your videos since Egypt’s New Capital keep it up ",
                "time": "2年前"
            },
            {
                "text": "I think China are possible to build up a infrastructure on silk road initiative",
                "time": "1年前"
            }
        ],
        "video": "1b4U_lUvKGU"
    }
,
    {
        "comment": [
            {
                "text": "As a Chinese, I think it's very nice   to have the western country to join this competition to build the  infrastructure all around the world.   It is long overdue. There used to be marshall plan  to help  only US allies to rebuild. Since then，  nothing happened to  other developing country.   My concern is United States is probably better in bombing than construction. Plus  It can take years for United States to build even in the United States. If it take a decade to build something for China, it's probably would take another century for U.S.",
                "time": "1年前"
            },
            {
                "text": "I am hundred percent sure that this will be more talk than action, simply because infrastructure development is not the strength of USA and G7 countries. Their value chain will not benefit from such initiatives. China built roads in some countries with discounted prices only because China can earn back the money from potential increase in trade. It USA and its allies really can help developing countries to improve their infrastructure, China will also benefit from increased trade more than the USA.",
                "time": "1年前"
            },
            {
                "text": "If BRI gets to make G7 to spend money on the global south, that in itself is already a success for BRI.",
                "time": "1年前"
            },
            {
                "text": "It's all about keeping their power over the poorer countries while at the same time stealing those countries wealth",
                "time": "1年前"
            },
            {
                "text": "I am very happy that China, a developing country, can become a common competitor of the seven developed countries. China welcomes them to compete fairly with China along the Belt and Road.",
                "time": "1年前"
            },
            {
                "text": "Countries with rising inflation, rising poverty, increasing wealth gap, decades-old infrastructure and societal disharmony making empty statements over wine and cheese.",
                "time": "1年前"
            },
            {
                "text": "They should do themselves a favor by not competing with China on infrastructure until they can do a better job in their own countries.   Belt and Road is not something that anyone can do with money.  Besides money it needs lots of engineers and skilled workers.  China is the only country can provide all that now.",
                "time": "1年前"
            },
            {
                "text": "I did not know that there was a difference between a democratic road and an autocratic road! Thanks G7 for enlightening us.",
                "time": "1年前"
            },
            {
                "text": "You don't train local workers for one-time projects. You bring in your workforce. Once the infrastructure project is built, it can be run by locals. Makes sense?",
                "time": "1年前"
            },
            {
                "text": "Western imperialism 2.0",
                "time": "1年前（修改过）"
            },
            {
                "text": "Next time G7 will come up with a new program- “ freedom electrical cars program “, after that it might be a “ democratic space program “, then “ breath free 0 carbon program “  , and so on to catch up with China.",
                "time": "1年前（修改过）"
            },
            {
                "text": "10 years of Chinese infrastructure in Africa cannot be undone.",
                "time": "1年前"
            },
            {
                "text": "Americans would rather the infrastructure money be spent on rebuilding American infrastructure first. Almost 10% of this country doesn’t even have safe clean water...",
                "time": "1年前"
            },
            {
                "text": "The real point here is how spiteful these Western imperialists truly are. They do not do this to help the poor continent of Africa to develop, which they had decades the chance to do instead of exploiting them but merely to counter China's development",
                "time": "1年前"
            },
            {
                "text": "The UN charter of human rights section 12 : the basic human right is the right to food, shelter, clothing, & access to medical care, but for the G7 if you are starving, homeless but have free speech you have all the human rights you need!",
                "time": "1年前"
            },
            {
                "text": "G7 wants to help other countries’ infrastructure while they can’t finish an airport or high speed railway in 10 years. WTF?",
                "time": "1年前"
            },
            {
                "text": "After China's entry into the WTO with the aid of merican regime it is estimated that 13 billion dollars is the net addition to Chinese GDP , while america have a net gain of the order of 11 billion dollars",
                "time": "1年前"
            },
            {
                "text": "If those countries are willing to accept Chinese BRI, think about how much worse the Westerners had offered.",
                "time": "1年前"
            },
            {
                "text": "That begs the question: why didn’t the West offer something before China?   Johnny come lately.",
                "time": "1年前"
            },
            {
                "text": "Positioning as a west against the east battle. How does Japan fit into this battle or are they considered a western country? The right thing to do is to work with China to built a better world instead of creating more conflicts. The old days of colonization is gone forever.",
                "time": "1年前（修改过）"
            }
        ],
        "video": "bbcY2XRWW_U"
    }
,
    {
        "comment": [
            {
                "text": "I just want every country should connect themselves with railways and roadways. That will be amazing ",
                "time": "2周前"
            },
            {
                "text": "Chinese think differently. These infrastructures will serve generations to come, wherever they connect people. It is not about addressing the economic situation that exists. It is about laying the foundation for future integration, across the continents. Regardless of the geopolitical governance that will be in place a century from now.",
                "time": "2周前"
            },
            {
                "text": "i love how most European always worry everything about China, meanwhile US interest has rooted in every dimension and no worried about that",
                "time": "3周前"
            },
            {
                "text": "Depending on each other is better than isolating each other",
                "time": "2周前"
            },
            {
                "text": "It is so interesting to see that Europe allowing US building military bases in their own territories and in the meantime preventing China to invest ports, bridge and railways in the name of dependency.",
                "time": "1个月前"
            },
            {
                "text": "After all is said and done, every country wish they were in China's position: To be a decisive and indispensable global economic player. ",
                "time": "2周前"
            },
            {
                "text": "People need to get over this thinking that we depend on China in reality we all depend on each other for one thing or another sooner we get that in our mind better it would be we all need to learn respect each other and need to learn to Co exist",
                "time": "2周前"
            },
            {
                "text": "that last sentence: \"the price to pay is becoming increasingly evident\"... what did I miss? The price to pay is having more foreign investment, more jobs, and more competitors getting part of the data, as previously all data was controlled by European logistics providers only, so what is the price to pay?",
                "time": "7天前"
            },
            {
                "text": "See DW and China, recognize what the video is about. Didn't disappoint, as usual.",
                "time": "2周前（修改过）"
            },
            {
                "text": "This documentary is brought to you by the country whose Chancellor's cell phone was eavesdropped by the American Master and whose billion-dollar pipelines were blown up by you-know-who.  Thank you for watching.",
                "time": "2周前"
            },
            {
                "text": "It takes strong and creative leadership that China has to make it go.",
                "time": "10天前"
            },
            {
                "text": "How do you rate this documentary?  I’m glad to see that most readers are pretty intelligent.",
                "time": "7天前"
            },
            {
                "text": "First Europeans should envision how to become sovereign nations then they'll able to look after Europe. Who will be beneficial for Europe and who is harming them, upon this the policies should be built up, but if Europe remains a vassal of anybody then it is God help Europe.",
                "time": "2周前"
            },
            {
                "text": "I agree with cautious choice to work with Chinese companies without demonizing them just because they are Chinese firms. Just think what if they are European firms or US firms, will that be much different? What are the costs and benefits? Is it better for local economy? What are the successful or failed projects that can be referred? Any project requires consensus and cooperation. Both partners have to get benefits from project to be win-win.",
                "time": "1个月前"
            },
            {
                "text": "Remember, each country is a souvereign nation. It's the country's own decision whether to improve their economy or not. They have the freedom of choice. At least there's a choice with China to improve your economy. With US you don't have a choice - remember the pipelines and the Ukraine war.",
                "time": "1个月前"
            },
            {
                "text": "Why do they need to mentioned about Taiwan, when the documentary is about New Silk Road?",
                "time": "2周前"
            },
            {
                "text": "I would like to see activists protesting Amazon, DHL, FedEx expanding their facilities. Oh wait, right, it's different I assume.",
                "time": "1个月前"
            },
            {
                "text": "Would be nice to have passengers RR cars tagging along I would pay to travel this way",
                "time": "2周前"
            },
            {
                "text": "The price to pay is not to interfere with China's domestic issues in their own backyard. After all, they do not stick their noses into EU affairs.",
                "time": "1个月前"
            },
            {
                "text": "Back to long history, Europe trade with Asia or China was controlled Arabians which was disadvantage for Eurpope.  The belt and road makes Europe as one end of the link ,and should benefit both Europe and Asia/China.",
                "time": "2周前"
            }
        ],
        "video": "0zfUSoWC4Eg"
    }
,
    {
        "comment": [
            {
                "text": "Has China's Belt and Road initiative impacted your country? Let us know in the comments below which country you're from and what are your thoughts on the New Silk Road to connect the world.",
                "time": "4年前"
            },
            {
                "text": "I am really impressed with what China has done in implementing belt and road initiatives in the region.",
                "time": "2年前"
            },
            {
                "text": "In 5 years, ASEAN will look so different from now. There will be many cities bigger and more modern than Singapore where so much more opportunities avail themselves easily. Singapore must appreciate what is happening around her and help her citizens to reap these opportunities as entrepreneurs, artists, educators, scientists, etc. It's no more viable to position Singapore as a \"hub\" for everything for only the \"select\". There are much bigger hubs with many more talents in ASEAN countries. Whatever we want to impress the world using the old paradigm cannot work anymore. No one cares about global rankings. What people want is happiness. And this comes from helping people succeed in their dreams. Dreams are for everyone. And everyone should be able to fulfill their dream in life. How did China do this for its 1.4bl people? How are they doing it for the rest of ASIA? It's not mind-boggling or scholarly but simply helping people to be happy. Once this principle is internalised and put into plans, investors will rush in. It's not about great systems. Systems will come later to support. Systems of themselves cannot sell without addressing people's needs first. This is what China stresses over and over - \"What we do must be for the people. If it is not for the people, we won't do it We won't do it for profit.\" And yet, profit just rolls in. It's NATURE at work - sincerity, honesty and a thought for the fellow man.",
                "time": "2周前（修改过）"
            },
            {
                "text": "Good show!  This show is very objective and you are reporting as you see it.  The world will be a better place if countries are welcoming win-win projects like the belt and road initiative projects.",
                "time": "4年前"
            },
            {
                "text": "Being from the US it has been eye opening watching these Silk Road documentaries. Being from the US I always have a somewhat distrust of China and some of their policies however when I see it costs a senior citizen couple 7500$ a year to live in a condo complex with nursing staff every 3 floors there are a lot of lessons we can learn here in the US. Just mind blowing the amount of economic zones and work being done by them around the world and neighbors.",
                "time": "3年前"
            },
            {
                "text": "Indeed an eye opening coverage that shows how far and wide such initiatives will cover. No wonder some Western countries are feeling the heat that their geopolitical coverage will be greatly contained in the very foreseeable future.",
                "time": "4年前"
            },
            {
                "text": "I love this series. Thank you so much. On perhaps a larger point, I wish more people in the world can see the reporting from CNA. People need to have more diverse sources of information and perspectives.",
                "time": "1年前"
            },
            {
                "text": "Hi Anthony, I wish you could visit Indonesia today as it joined One Belt One Road Initiative as well as Marine Silk Road with China. All your reports on OBOR initiative are really unbiased as you interviewed both sides of the people with respectful questions.",
                "time": "2年前"
            },
            {
                "text": "Hello Anthony, you are really neutral in reporting the Belt and Road Initiative projects in ASEAN countries, I love your style of reporting from different approach on economy benefits rather than political point of view as other reporters do. You did the right things and interviewed the right people to discuss the benefits of the projects for the locals. Keep the good works !.",
                "time": "2年前"
            },
            {
                "text": "Loved this video it has given me great hope for humanity to start an end to all these Tribal & Military Industrial Wars that has divides us all.",
                "time": "4年前"
            },
            {
                "text": "We help build the world, and I’m really proud of that.",
                "time": "1年前"
            },
            {
                "text": "Let's work together and build a peaceful world!",
                "time": "4年前"
            },
            {
                "text": "Wonderful presentation. Keep up the hard work.",
                "time": "1年前"
            },
            {
                "text": "As an Accountant and Political Economist by profession, my perception is that, since the 1980s, the USA and its Western allies have been inciting and sponsoring devastating wars aimed at regime changes in order to maintain their geo-political interests. While China on the other hand has been busy focusing on economic growth and development, infrastructure investment linking many developed and developing countries and lifting up millions of Chinese and other countries citizens out of poverty. China has never invaded and changed regimes in any country in the world. China’s win-win model of international economic relations is the best model that makes the world a better place. Bravo China. You can all read more about the following; 1-AIIB(Asia Infrastructure Investment Bank),2-BRICS, 3-China’s Model of Economic Growth and Development.",
                "time": "3年前（修改过）"
            },
            {
                "text": "very nice border, very peacefull and integrated.",
                "time": "4年前"
            },
            {
                "text": "Beautiful documentary and great work !",
                "time": "3年前"
            },
            {
                "text": "Absolutely appreciate this show",
                "time": "4年前"
            },
            {
                "text": "I always love your episodes about silk road.",
                "time": "3年前"
            },
            {
                "text": "South East Asia,china,japan,korea should unite like eyourop union.",
                "time": "4年前"
            },
            {
                "text": "Great content, you hit a nail right on the head,  right on the track this is the information that I have looking for., thanks for doing this, it saves me a lot of time. May I suggest you do the pros and cons of OBOR because every country has its own unique culture, the politicians, of course, will find the ways to corruption just like  Malaysia and other leaders. So you have a lot of videos to do for all member countries all the way to EU, that would be very interesting more than the trade war. Where is the road where is development, the local poor, at least can earn a living which is their leaders cannot provides? Of course, the Chinese, benefit the most, however, it creates opportunities for the locals to step forward and perhaps be their own boss and independent. The enemy of OBOR is corruption, security, the envy from the US and EU fear of losing control and lost the power of war business, control oil, food and drugs and destroying the poor countries for benefits, which are now the Chinese is doing the opposite. As a result, the Western Imperialist are not happy with China. Cresting trade war to stirring another war by using their puppets, Taiwan, S. Korea and Japan bashing China about S China Sea and trade, just to destroy China's development the world.",
                "time": "4年前"
            }
        ],
        "video": "Kw6SLjeywtI"
    }
,
    {
        "comment": [
            {
                "text": "Military functionality was designed into the root of this system, and as with all military systems at the core of any technology (such as nuclear weapons), other 'peaceful systems' may arise from it, but make no mistake, the military functionality will remain (and eventually be used from it), regardless if the peaceful application remains, or not...",
                "time": "1年前"
            },
            {
                "text": "Realpolitik demands that America come up with a real formula, fast, to challenge China, if that is the objective. Just scaring nations about what China might do to them, or just resorting to tired old invasions, sanctions, proxy wars, and bullying is so yesteryear. This development is not as scary to most nations as it is to Westerners, because they have experienced the heavy boot of colonialism on their necks. Its mutating form still plagues the world: Iraq, Syria, Libya, Yemen, Afghanistan... The world understands Imperialism. It has no experience with China being such.",
                "time": "1年前（修改过）"
            },
            {
                "text": "to subdue the enemy without fighting...",
                "time": "1年前"
            },
            {
                "text": "It makes sense because they have to protect their interests. If United States and Europe have bases around the world to protect their interests, I find it reasonable for China to do the same",
                "time": "2年前（修改过）"
            },
            {
                "text": "The latest is the situation in Afghanistan.  That country links China in the east and Iran in the west.",
                "time": "1年前"
            },
            {
                "text": "We built our interstate system in the US to move military assets across the country.  There is always a military and projection of power aspect to most massive public works projects.  The US and it's partners should attempt to be the benefactors in the nations that need connecting.",
                "time": "11个月前"
            },
            {
                "text": "While I'm concerned about China's rising, I find it ironic that US officials criticize China for building \"ports\" everywhere when they have actual military bases all around the world.",
                "time": "1年前（修改过）"
            },
            {
                "text": "Don't blame China for doing this, I'd do it too if I were them.  Most countries want economic and political clout.  Feels like on the current trajectory China will be number one super power in 20 to 30 years.  The amount of construction and innovation they are doing is astounding.",
                "time": "1年前"
            },
            {
                "text": "Nice presentation from M Rusell. It is aligned with the US discours that China are the bad one. When the #1 ruler is at risk of losing is place we assist that kind of arguments and many weaponise actions are made like the swift, semiconductor, Huawei ban....",
                "time": "2年前"
            },
            {
                "text": "Don’t be afraid of your own shadows.",
                "time": "1年前"
            },
            {
                "text": "The US law requires that everyone have equal opportunities regardless of race, color, national origin, religion, sex (including pregnancy, sexual orientation, gender identity or transgender status), age (over 40), disability, genetic information, retaliation for engaging in Equal Employment Opportunity (EEO) activity, ...Hum? Unless you are part of the remaining 96% of humanity? That have no Bill of Rights???...We The People!    I don't believe the word \"Citizen\" even appears in any of these amazing famous documents! (except for the Natural-born-citizen clause for US president)",
                "time": "1年前"
            },
            {
                "text": "I just find it funny how American military is talking about the threats of BRI, because these civilian ports might supply military in the future. Meanwhile, the US has actual military ports all over the world already.",
                "time": "2年前"
            },
            {
                "text": "Simply BRI is pacing Chinese Economic Dominance. Win for China. But can be a win for client counties if they manage loan well. Better infrastructure increase GDP which results into more Purchasing Power for people to purchase more products from china. BTW That's what British Empire and USA did in their times.",
                "time": "1年前（修改过）"
            },
            {
                "text": "Why is an American Diplomat in a top management position in an \"Asia\" Society organisation?",
                "time": "2年前"
            },
            {
                "text": "China is greatly respected in all of Asia mostly except for India and Vietnam but in Pakistan we respect them because they don't invade and kill and bully Nations.",
                "time": "1年前"
            },
            {
                "text": "Looks like China learned from both the British empire and the US hegemony. Hopefully for everyone involved it will turn out well.",
                "time": "2年前"
            },
            {
                "text": "\"China has repeatedly insisted that the initiative is for peaceful purposes only\" -- not really -- they say it is for \"heping\" (harmony and stability). That is a keyword in a list of 10 keywords used by the CCP to define the goals of \"Communism with Chinese Characteristics\". In practice what \"heping\" actually means is \"we will suppress all unrest, protests, complaints, and bad behavior\". They are trying to roll that model out worldwide, which implies they want to actually run the world. They're doing it through soft power, which is another reason they can claim it's peaceful.",
                "time": "1年前"
            },
            {
                "text": "They just built one in Surrey BC. It looks like a military base not some trade depot.",
                "time": "2年前"
            },
            {
                "text": "I can see nothing is wrong with the BRI.  Instead of raising suspicions on Chinese initiative, its all self professed as smart planning, putting those ports in maximum usage. Brilliant moves indeed on the Chinese initiatives.",
                "time": "2年前"
            },
            {
                "text": "true...",
                "time": "1年前"
            }
        ],
        "video": "PX5PnnnYrFw"
    }
,
    {
        "comment": [
            {
                "text": "I'll never be surprised that someday China can exert influence as far as EU to better serve their agenda someday. They really outsmarted Europe and America in many ways. Credits for their strategy.",
                "time": "3年前（修改过）"
            },
            {
                "text": "Chinese intentions are the same as the U.S. and E.U., they’re just more friendly and less punitive. It’s a good strategy to invest in future friendships: build their infrastructure, don’t attach too many conditions, and be ambitious.",
                "time": "2年前"
            },
            {
                "text": "I don't know whether this plan is good or bad, I only know that west reacting to this plan so intensive meaning that some countries's cakes have been cut more off",
                "time": "3年前"
            },
            {
                "text": "You're right, man!  We want a lot of money!  Very big house!  Cool car!  All practical things!  The Chinese concept of thousands of years is inseparable from four words: safety, residence, happiness, career!  Chinese parents want their children to be stable. This kind of thinking lasts for thousands of years!",
                "time": "2年前"
            },
            {
                "text": "I think it means an option or a chance, better than no options no chances.",
                "time": "3年前"
            },
            {
                "text": "The purpose is very simple. It is to drive up more demands and make more money for all involved. Countries have been voting with their feet already. Very amusing to see so many different role plays that you can only see in novels. I guess that we are only humans with defined human natures. Someone really can write novels on this subject that has been written so many times in history.",
                "time": "3年前"
            },
            {
                "text": "Asking the chap from Taipei if BRI is good is like asking the cat if he likes the dog.",
                "time": "2年前"
            },
            {
                "text": "If I were a German I would worry my own crumbling infrastructure before I worry China. ",
                "time": "3年前"
            },
            {
                "text": "I feel sad for German, not an independent country, including military and media.",
                "time": "3年前"
            },
            {
                "text": "As compared  USA china doing very well without Gun ",
                "time": "2年前"
            },
            {
                "text": "the problem with the west is their attitude, they expect China's belt and road as some kind of charity, and anything short of giving out things for free, is China's fault and must have some dark motives. Why is it wrong for China to pursue their own economic interest, and negotiate deals with another country without scolding from the West? belt and road countries are adults and don't need their colonial mothers to hover around. There are 2 goals for belt and road, one short term, the other long term.",
                "time": "3年前（修改过）"
            },
            {
                "text": "Literally finishing Peter Frankopan’s ‘The New Silk Roads’ this morning, talks a lot about this.",
                "time": "3年前"
            },
            {
                "text": "China is doing so much for expanding its business.",
                "time": "3年前"
            },
            {
                "text": "In a",
                "time": "2年前"
            },
            {
                "text": "Is incredible that the FMI can impose austerity measures in the developing world, support dictatorships in a neocolonial manner and no one will talk about it. But China just trying to help them without unfair interest rates, in a collaborative way instead of the traditional imperialism that OMG, they are so wrong, how could they?",
                "time": "3年前"
            },
            {
                "text": "Love it, it will bring us together and improve global economy and well being of people.",
                "time": "2年前"
            },
            {
                "text": "The main purpose of the belt initiative, is for China to have access to resources and trade in the event of a naval blockade by the US.",
                "time": "2年前"
            },
            {
                "text": "There we go !!",
                "time": "2年前"
            },
            {
                "text": "One of the fundamental displays of Western arrogance is that they're rarely humble enough to listen. On such China-specific topics, one would naturally expect to find an opinion from a real Chinese person. However, Western media never seem to consider the possibility of interviewing someone from Mainland China who actually knows the issue (real Chinese people, experts or even ordinary citizens); rather, they would automatically turn to anti-China \"China experts/observers\" from Western countries (and in this case, a clueless person from the island of Taiwan) in order to echo their preconceived and prejudiced narrative. If you're not really looking for even a modicum of truth or insight on this topic, but only goes after what you want to hear--the same cliches palatable to your ears, then your self-consolation will only lead to misinformation and misjudgment.",
                "time": "2年前"
            },
            {
                "text": "Asking a Taiwanese about China is like asking a Polish about Russia.",
                "time": "2年前"
            }
        ],
        "video": "8DRk8iqjm1E"
    }
,
    {
        "comment": [
            {
                "text": "On aspect of the BRI, which should have been discussed in this video, is how developed countries are all now, under the pretext of \"competing with the BRI\", providing development options to developing countries as well.  The BRI isn't just amazing for what it alone has done, but for giving other nations the motivation to help develop developing nations as well.",
                "time": "11个月前"
            },
            {
                "text": "To developing countries, the belt and road initiative present interesting opportunities to grow their economy. The entire world saw how China was able to rapidly grow its economy by investing in infrastructure and manufacturing. The developing counties also want to do the same thing as China, which is why many signed up to this project, and this project is their best bet. Loans from western governments often include a lot of austerity measures, while loans from China just need you pay P&I. Unless the West is able to offer something better for these countries, it will be hard to stop this project, as you cannot stop countries from trying to better themselves.",
                "time": "2年前"
            },
            {
                "text": "One major reason the Arab Spring rose so quickly in Egypt was the selling of much of the Nile land (the only fertile area feeding 80 million people in the world's driest country) to multinationals -who then leased it back to the farmers at up to 2,700% price hikes.",
                "time": "1年前（修改过）"
            },
            {
                "text": "To quote Theodore Roosevelt:",
                "time": "2年前（修改过）"
            },
            {
                "text": "Please do one about the Titan 1 underground missile bases. I was absolutely blown away by their size and complexity when I first learned about them. A true megaproject!",
                "time": "2年前"
            },
            {
                "text": "Thank you for making this video. It is very fair and open discussion about the belt and road initiatives. As a Chinese American I felt like it is the first time a westerner report this project without bias. I agree deeply with you that the result is remaining to be seen. However I strongly believe that it might be the greatest effort achieved by human to reach and connect so many countries. Also I agree with you that many local governments are responsible for their own when decide to take loan.",
                "time": "2年前"
            },
            {
                "text": "\"It's easy to fear change when we look down from our Ivory towers.\" Fantastic writing Olivier and presenting Simon. For some reason that line struck me.",
                "time": "2年前"
            },
            {
                "text": "I simply can't get enough Megaprojects videos! Love everything that you guys have put out!",
                "time": "2年前"
            },
            {
                "text": "Thank you Simon for yet another excellent video, presented expertly and professionally. Your commentary is simply wonderful and I am very impressed. As for the content, it is fantastic and very educational with very factional information that really leaves me with a sense  of deeper knowing and a desire to learn more on the topic. Please keep up the excellent effort and keep these videos coming, thank you.",
                "time": "2年前"
            },
            {
                "text": "Good coverage of a complex topic. I did a deep dive on this topic for a research client and I think you’ve been very even handed while accurate hitting some of the most salient high and low notes. I don’t know if you’ve covered this but the Bohai Rim mega-region development project might be of interest to you and your audience. In terms of scale it the domestic equivalent to what the Chinese are trying to pull off abroad.",
                "time": "2年前"
            },
            {
                "text": "Great job being unbiased. Excellent video ",
                "time": "9个月前"
            },
            {
                "text": "Do the SS United States. It was the pinnacle of the steamship liners and had a ridiculously high top speed for a ship of it's size. It held the record for the transatlantic for like 40 years and represented a hundred years of the shipping industry's achievements",
                "time": "2年前"
            },
            {
                "text": "A $1 trillion dollar project spanning 36 years connecting China to the whole world vs. Half the budget of the Cares Act which propped up the US ticking along (mostly) for 4 months....",
                "time": "2年前"
            },
            {
                "text": "Megaproject suggestion: Strahov Stadium. You can film it on location!",
                "time": "2年前"
            },
            {
                "text": "How about the Grand Trunk Road that connects Chittagong in Bangladesh near Myanmar, to Kabul. It was first built at the time of Alexander. Over the millennia, it has been used by traders and conquerers. Those  ruling over the region's it goes through have contributed to its maintenance. This road still exists today now running through 4 countries.",
                "time": "2年前"
            },
            {
                "text": "Hey Simon! Love your content! So I'm watching this WWII doc and they mention the \"Mulberries\". They spend only seconds on them but they seemed massive and very critical. Just an idea to throw to you. Keep up the great work!",
                "time": "2年前"
            },
            {
                "text": "Simon, can we break this down into the different routes and such? It would be awesome to hear more about this, in-depth.",
                "time": "2年前"
            },
            {
                "text": "New subscriber. I really appreciate the structure and delivery of the videos I’ve seen. Definitely learn something.  Fellow fan of the SR71/A12.  Really like your set too.  Keep up the good work.",
                "time": "2年前"
            },
            {
                "text": "Imagine USA spend their trillions in their economy instead of Military.",
                "time": "2年前（修改过）"
            },
            {
                "text": "Speaking of Malaysia one of these days you should do the Petronas Towers. Once held the tallest building record in the world and still retains the tallest twin towers record. Designed by an Argentine and built by South Koreans and Japanese, the building is a symbol of Malaysia becoming an international hub.",
                "time": "2年前"
            }
        ],
        "video": "AsVEKxI02d0"
    }
]