[
    {
        "comment": [
            {
                "text": "For many many years I have been a great believer it traditional Chinese medicine. Not just acupuncture. If it's been going for 3000 years there must be something to it. I had eczema on my leg and tried all the creams my doctor prescribed to no avail. Then I tried a Chinese remedy. It disappeared completely within a week and has not come back. That was eight years ago.",
                "time": "6年前"
            },
            {
                "text": "Thank you, Charmian! I have to say that this is one of the best motivational ted talks I have seen. You had to choose the majority in traditional medicine it's definitely a tough choice on this day in Western, you don't care about the other assessment, critics, you see the power of Traditional medicine and you protect ít and bring the pure quality to treatment. You also point out 2 different features such as the art is all your patient not only by this disease, the second is ego in western medicine may keep the patient far away to them, we can be lost the physical interaction and mindful connection to them so many cases can't cure efficiently. Thank you! Good luck!",
                "time": "1年前"
            },
            {
                "text": "Brilliant, so interesting about the lady with fertility problems. Would have been nice to see more of the video of the person with lower back pain...we need more talks on TED about alternative medicine!",
                "time": "9年前"
            },
            {
                "text": "She actually has a quite accurate description of what \"Qi\" really means. No, it's not an energy, nor a field, nor a force. It is perhaps at best described as a pattern. One analogy would be with economy. There isn't a physical thing that constitutes economic boom or recession, but a pattern of the entire system.",
                "time": "4年前（修改过）"
            },
            {
                "text": "Great speech!  There are so many Chinese who don’t understand CTM and look down at their own cultural heritage",
                "time": "3年前"
            },
            {
                "text": "My nephew's urticaria was 100% cured by TCM(Tradtional Chinese Medicine). He's been cured of it for 3 years now. From what I've read of conventional western medical treatment of urticaria, they would have him on daily Zyrtec pills. In a few years it would fail, then he would take monthly Xolair shots, then that would fail and he would end up in ER and given Prednisone steroid shots, but that would eventually fail too. I'm so glad we tried TCM. It only took two months and only $170 with TCM.",
                "time": "7个月前"
            },
            {
                "text": "I feel so motivated , idk why but its sounds great. TCM is also about herbs , not only acupuncture. so, I think, people who said it have not proven yet, you're wrong.",
                "time": "5年前"
            },
            {
                "text": "Chinese medicine student is here, i think what she said is very nice just a foreigner, i hope more foreigner will know about and learn it",
                "time": "3年前"
            },
            {
                "text": "the placebo effect is powerful! just talking can change the brain and the body will respond.",
                "time": "8个月前"
            },
            {
                "text": "People can understand TCM is really clever and open minded. It's my philosophy and life style",
                "time": "9年前"
            },
            {
                "text": "Can we also take a moment to emphasize that placebo is a powerful example of the power of the mind and healing the body? It’s interesting how western science just totally overlooks that.",
                "time": "5个月前"
            },
            {
                "text": "The biggest evidence for the effectiveness of Chinese medicine that anybody can observe I think is that the country with the biggest population whether now or in ancient times relies on this medical system for the most of its history. If it doesn't work, there wouldn't be so many people then. It's a system based on 3000 years of experience. Some rationale is there and working even the current science can't explain for now. And I think one reason for the lack of CURRENT science base of Chinese medicine is the lack of interest and real research which costs.",
                "time": "6年前"
            },
            {
                "text": "Chinese medicine #1 I love it!!!",
                "time": "5年前"
            },
            {
                "text": "I tried acupressure for weight gain. I was losing weight since the past 7-8 months. Initially my weight started decreasing, and then within 3-4 months i could 2kgs, with just one acupressure point.",
                "time": "4年前"
            },
            {
                "text": "I need to see how to put this together!!",
                "time": "4年前"
            },
            {
                "text": "TCM is a wholly different system from modern medical science system. Do not try to use one system to explain another different system. Herb is actually more broad and powerful than acupuncture, but unfortunately, a lot of people can’t master it and the regulation is bad too.",
                "time": "11个月前"
            },
            {
                "text": "\"I've heard Western medicine is stuck in Newtonian physics, whereas TCM focuses on Einsteinian physics.. it made sense to me..\"",
                "time": "7年前"
            },
            {
                "text": "a good TCM doctor must have  got TAO as well，we call them 神医， which means a doctor like God",
                "time": "2年前"
            },
            {
                "text": "I've heard Western medicine is stuck in Newtonian physics, whereas TCM focuses on Einsteinian physics.. it made sense to me..",
                "time": "8年前"
            },
            {
                "text": "CHINESE   MEDICINE   IS  A   VERY   PRECISE   MEDICINE.  DG",
                "time": "3年前"
            }
        ],
        "video": "iQJFp5UIaOY"
    }
,
    {
        "comment": [
            {
                "text": "My nephew's urticaria was 100% cured by TCM(Tradtional Chinese Medicine). He's been cured of it for 3 years now. From what I've read of conventional western medical treatment of urticaria, they would have him on daily Zyrtec pills. In a few years it would fail, then he would take monthly Xolair shots, then that would fail and he would end up in ER and given Prednisone steroid shots, but that would eventually fail too. I'm so glad we tried TCM. It only took two months and only $170 with TCM.",
                "time": "7个月前"
            },
            {
                "text": "Excellent information and promotion on Chinese Medicine, thank you!",
                "time": "2年前"
            },
            {
                "text": "her voice is so relaxing",
                "time": "2个月前"
            },
            {
                "text": "Love the fact that he automatically says “he” for doctor and the doctor is a woman. ",
                "time": "1年前"
            },
            {
                "text": "The best massage service in Fayetteville, NC, uses traditional Chinese medicine to go beyond physical benefits and improve cognitive functions",
                "time": "1个月前"
            },
            {
                "text": "Tcm is amazing.",
                "time": "4年前"
            },
            {
                "text": "Thanks, that was great.",
                "time": "6年前"
            },
            {
                "text": "Did anybody notice how cool this chicks hair looks like how’s it so shiny and smooth looks like it’s from a cartoon! Crazy",
                "time": "2年前"
            },
            {
                "text": "Very well done,come  from  china",
                "time": "2年前"
            },
            {
                "text": "I don't like TCM, the awful taste, the smell, take a hella long time brewing the medicine, and the herbs normally put my appetite off just by seeing it.",
                "time": "9个月前"
            },
            {
                "text": "Excellent",
                "time": "2年前"
            },
            {
                "text": "chinese  medicine  is  best",
                "time": "2年前"
            },
            {
                "text": "Hi Britta! Remember Ashoke from Nepal?",
                "time": "3年前"
            },
            {
                "text": "TCM can heal the cancer, but a little complicated, because it’s very much personalized solution. Much more powerful and safer than chemotherapy.",
                "time": "11个月前"
            },
            {
                "text": "it doesnt have , it open::::::::::::::::sand firm",
                "time": "3年前"
            },
            {
                "text": "lot's of silent graves are not commenting here :)",
                "time": "4个月前"
            }
        ],
        "video": "S8VApNJwqSI"
    }
,
    {
        "comment": [
            {
                "text": "This is quite common in the Asian countries. India has Ayurvedic medicines which is all natural stuffs. Buddhists high on the Himalayas mountains of Nepal habe unique plant based medicines. However, their effectiveness is not proven.",
                "time": "4年前"
            },
            {
                "text": "Well, I hope chinese universities buy every single thing in that market and conduct thorough testing. Of course I doubt there's anything really toxic among that stuff, but continued use of certain stuff over years... who knows.",
                "time": "4年前"
            },
            {
                "text": "More than 900 Chinese traditional medicine ingredients were patented by international drug companies already.",
                "time": "4年前"
            },
            {
                "text": "As wrong as this is, I think it would be hard for many to drop it, just like religion. Although it might be old and we’ve learned better, many still believe it and a whole generation would have to be corrected. Sad, but understandable",
                "time": "2年前"
            },
            {
                "text": "Animal: ",
                "time": "3年前"
            },
            {
                "text": "I have just sprained my wrist - western medicine says 2 to 10 weeks to heal and use RICE - me I use TCM  a combination of Tieh Ta Yao Gin and Dit Dat Jow  massage and stretching with heat  pain experienced at 1st but after now only 2 days I have 80% full movement in my wrist- required to apply the medicine at least 6 to 7 times a day and almost healed - I have been using TCM for over 15yrs and I am not an Asian I use TCM for almost all of any medical problems",
                "time": "3年前（修改过）"
            },
            {
                "text": "Quinoa a growing trend says its health benefits are a super food, yet it only equates the same health value as a potato. Time for people to research, it looks like a growing trend where advertising is duping society.",
                "time": "4年前"
            },
            {
                "text": "Do some investigation before your guys drawed the biased conclusion on chinese medicine",
                "time": "4年前"
            },
            {
                "text": "Which market is this n which city plz help",
                "time": "3年前"
            },
            {
                "text": "Don't forget to drink hot water.",
                "time": "4年前"
            },
            {
                "text": "Please ban those medicines, specially those which involves animal derivatives, these kind of things encourage poaching and make it a lucrative business.",
                "time": "11个月前"
            },
            {
                "text": "The reason most of the tigers, elephants, and rhinos are almost extinct",
                "time": "4年前"
            },
            {
                "text": "How about natural organic opium?",
                "time": "4年前（修改过）"
            },
            {
                "text": "The lady in the red coat.",
                "time": "4年前"
            },
            {
                "text": "Pakistan .....also like this",
                "time": "4年前"
            },
            {
                "text": "Wow, people are desperate",
                "time": "8个月前"
            },
            {
                "text": "I like China health treat ments",
                "time": "3年前"
            },
            {
                "text": "Yes ...",
                "time": "4年前"
            }
        ],
        "video": "yVZAIS2cj3c"
    }
,
    {
        "comment": [],
        "video": "G87SfHPHj0A"
    }
,
    {
        "comment": [
            {
                "text": "the major problem is not necessarily the effectiveness of TCM, but the fact that animals are going extinct because of the demand for their bodyparts.... ",
                "time": "5年前"
            },
            {
                "text": "What is the most effective Chinese medicine used for preventing bad breath odor?",
                "time": "5年前"
            },
            {
                "text": "Awesome video! What kind of potato did you use to record the narration? Let's get some subtitles on here.",
                "time": "5年前"
            },
            {
                "text": "Great",
                "time": "3年前"
            },
            {
                "text": "How to get Chinese natural herbs",
                "time": "1年前"
            },
            {
                "text": "Pls mention real source of containt  - centipedes; Caterpillar; Bats; Rats; cockroach",
                "time": "2年前"
            },
            {
                "text": "This isnt good. Those ingrediants need to be boiled, not steeped. Almost all hebs need to be boiled. It breaks down the plant... what a proufoundly sad situation.",
                "time": "2年前"
            },
            {
                "text": "Good information but your sound no good. You should have used a separate recording device",
                "time": "3年前"
            }
        ],
        "video": "QVyIOW5_TFY"
    }
,
    {
        "comment": [
            {
                "text": "Thank you for promoting the power of Chinese medicine.",
                "time": "2年前"
            },
            {
                "text": "This is an excellent introduction to a beautiful way of life",
                "time": "2年前"
            },
            {
                "text": "Black tea is amazing like it tastes awesome with milk in it",
                "time": "2年前"
            },
            {
                "text": "☀",
                "time": "2年前"
            }
        ],
        "video": "kfUI9v_iqfg"
    }
,
    {
        "comment": [
            {
                "text": "The combination of Eastern and Western = the best",
                "time": "3年前"
            },
            {
                "text": "She speaks with such wisdom and calmness ",
                "time": "2年前"
            },
            {
                "text": "I’ve before thought I was endangered just being lead into the mental health community.  I’ve seen an acupuncturist before and liked mostly the diet I was on and now almost back on a vegan diet although was wondering what foods are good for healing in Chinese medicine. I now know theres a field that knows me very well and listens to me through my hardships.  Although I have my PhD in sociology and am wanting to be part in learning Chinese Medicine, the diet, meridians,  and so on, I also don’t want to any longer feel endangered. Thank you for this video.",
                "time": "3个月前"
            },
            {
                "text": "Lixin: Thank you for  your inspirational talk! Your life is the great inspiration itself.  Much love!\n",
                "time": "10年前"
            },
            {
                "text": "Human beings need to take care of their environment because their health depends on it - Lixin Huang",
                "time": "2个月前（修改过）"
            },
            {
                "text": "Wowwwww!!!!! What an inspirational Woman and Story. Much RESPECT and LOVE sent your way Queen. Mother Earth appreciates the wisdom you share with your fellow human brothers and sisters. Respect and Love must be restored to Mama Earth Gaia whatever you want to call her. She is suffering and so are her babies. We MUST do OUR PART and spread the awareness and LOVE. Lets lead by example my fellow leaders.",
                "time": "4年前"
            },
            {
                "text": "Back in the 1990s  I wanted to take the full TCM course but  I couldn't afford it at the time, I ended up just going to different Libraries and reading up on TCM  there wasnt much informnation on it . I do practice Chi Gong Tai Chi and meditate, acupressure  but  I always wanted to learn the TCM ",
                "time": "3个月前"
            },
            {
                "text": "Disclaimer for those who haven't tried Chinese medicine: it doesn't have instantaneous effects and it will take a while for the benefits to show, so follow your medication schedules and everything should be better eventually. Take care!",
                "time": "7个月前"
            },
            {
                "text": "I'd love to see the follow-up to this lecture. It's excellent, and regulation and compliance along with cultural beliefs and geopolitics is soooooo complex.",
                "time": "1年前"
            },
            {
                "text": "That’s So True Queen ",
                "time": "11个月前"
            },
            {
                "text": "Thank you, I learned so much.",
                "time": "5个月前"
            },
            {
                "text": "Thank you for sharing this! This was a required video to watch for a holistic mind-body healing course. Going to share this with my qigong students, such great mention for this ancient practice.",
                "time": "1年前"
            },
            {
                "text": "Very interesting.  We need to respect our ancestors for their intimate ancient knowledge of themselves and the world.",
                "time": "3年前"
            },
            {
                "text": "An enlightening and inspiring lecture.....Traditional Chinese Medicine originated from the ingenuity of numerous ancient Chinese great minds and the following researchers....",
                "time": "7年前"
            },
            {
                "text": "Amazing how so many say it's bullshit that have never tried it. I had terrible asthma attacks 2 years ago after I quit smoking.I didn't have an inhaler prescribed though as the doctors initially underestimated how serious the issue was at the time. I was taught the lung meridians and other acupressure points and I massaged them immediately when the attacks would set on and they would dissipate rapidly. It saved my life. If I hadn't known acupressure and very basic herbology I might not be alive.",
                "time": "6年前"
            },
            {
                "text": "This beautiful lady is speaking the truth May nature protect u and give more love and guidence",
                "time": "2年前"
            },
            {
                "text": "I believe I would have been in a nursing home by now if I had not learned medical qi gong with BIGU and special abiities to heal myself.  QinWay System GI Gond, still a spot left in the last retreat before she retires. COming to USA this Sept, 2021. Life changing transformation possible and guaranteed if you following what was learned in this seminar",
                "time": "1年前"
            },
            {
                "text": "Struggled my whole life with candida , sick of living like this and going to try TCM , great presentation and thank you ",
                "time": "3年前"
            },
            {
                "text": "I like traditional medicine.",
                "time": "2年前"
            }
        ],
        "video": "XbLAoUG3wmY"
    }
,
    {
        "comment": [
            {
                "text": "I must say she’s really a good host and ambassador. The pace, the eye contact, the pleasant vibes, the way to tell a narrative in short and interesting form.....",
                "time": "2年前"
            },
            {
                "text": "She is awesome and I truly enjoyed her segment on this. I appreciate her time and introduction for people like myself. I am highly interested in Chinese medicine for myself so this was such a great start. I wish she had her own channel because I know there are so much to cover. Great video I really enjoyed!",
                "time": "1年前"
            },
            {
                "text": "Wow! This lady is so beautiful and knowledgeable and such a natural on camera. Miss Lady should have her own YouTube channel to share her wisdom. I would love to be her student and learn about TCM.",
                "time": "3年前"
            },
            {
                "text": "I love this. As a chef, I am trying to branch out into medicinal cooking. This is so helpful and it's nice that they now have a substitute for shark fin.",
                "time": "1年前"
            },
            {
                "text": "I could listen to her speak for hours!",
                "time": "3年前"
            },
            {
                "text": "Wow this was amazing! Brought tears of joy! ",
                "time": "2年前"
            },
            {
                "text": "I found this very interesting and informative. I’ve just started going to an acupuncturist for my lower spine who also deals with herbs. I have great respect for this ancient healing.",
                "time": "2年前"
            },
            {
                "text": "Was always interested in TCM but can never find any good resources to learn it online for free, like what they'd teach you in this store. Although I don't believe in a lot of what TCM offers for its foundational working such as the existence of Chi, I do believe that the 1000s of year of research into various herbs and spices and their combination / application can remedy all kinds of diseases and disorders with little to no side effect that modern medicine doesn't offer. The application and knowledge really needs to be combined into modern medicine so that instead of relying solely on extremely expensive synthetic drugs, more research can be put into TCM with a combination of modern medical practices and some drugs.",
                "time": "2年前（修改过）"
            },
            {
                "text": "She is so awesome. This is my first day of learning about Chinese medicine. Her English is so good. I also love the packaging of the more modern Chinese medicine",
                "time": "2年前"
            },
            {
                "text": "I appreciate this medicine, primarily bc of the symbiotic relationship with nature. We need so much more of this in the western world.",
                "time": "2个月前"
            },
            {
                "text": "This is educational for me as first TCM user, I have frozen shoulder and neck pain for 5 years now and recently was introduced to TCM especially acupuncture and it helped me a lot and looking forward to taking the powder form of the treatment. The taste of the powder medicine is really awful but I’m positive and hopeful that in 7 days time it will cure my illness…",
                "time": "9个月前"
            },
            {
                "text": "Excellent introduction to Chinese medicine, and she is a very easy to follow presenter. Really like her presentation.",
                "time": "2年前"
            },
            {
                "text": "The whole philosophy and attitude behind Chinese medicine is very interesting. Yin, Yang, Heat, Metal and Wood Elements, Balance. It’s extremely health conscious and the people who follow it are very into welbeing. It’s a very different image of Asia being polluted in the air and unhealthy. The Medicinal aspect of Chinese culture is quite health conscious. It’s a very fascinating contrast. I always walked past these stores as a kid but never really delved into the field and studied it, and this video was very educational. Especially with Singaporean English, its so helpful, because English is my first language so its just much easier for me to understand, and accessible. ",
                "time": "2个月前（修改过）"
            },
            {
                "text": "I hope she can explain all the stuff that she is selling and provide a site that we can buy it. thank you for your education about Chinese herbs!",
                "time": "6个月前"
            },
            {
                "text": "She’s so informative and passionate about TCM! I loved the video ",
                "time": "1个月前"
            },
            {
                "text": "Full of positive vibes with a cheerful smile ",
                "time": "1年前"
            },
            {
                "text": "She just gave us 2 years of schooling in 10 mins. Thank you!!",
                "time": "2个月前"
            },
            {
                "text": "I love tcm and acupuncture.",
                "time": "4个月前"
            },
            {
                "text": "Please do more videos to educate us on various aspects of TCM. It will help boost our confidence to TCM medications. Many thanks",
                "time": "3年前"
            },
            {
                "text": "Good informative video on TCM. Hope to see more educational video on different Traditional Chinese Herbs and their medicinal property. Thank you!",
                "time": "2年前"
            }
        ],
        "video": "dpOv9gr8MP8"
    }
,
    {
        "comment": [],
        "video": "HifIpXVbwRs"
    }
,
    {
        "comment": [
            {
                "text": "Ayurveda and traditional Chinese medicine have many commonalities. The focus of both the systems is on the patient rather than disease. Both systems fundamentally aim to promote health and enhance the quality of life, with therapeutic strategies for the treatment of specific diseases or symptoms in holistic fashion.",
                "time": "1个月前"
            },
            {
                "text": "My problem is always expelling the wind causing my cancer. Ain’t easy.",
                "time": "9个月前"
            },
            {
                "text": "What is a heat based cold and how does one collect the flu inside of you",
                "time": "2年前"
            },
            {
                "text": "Peshab mein dhaat nikalta hai",
                "time": "1年前"
            },
            {
                "text": "I feel like a lot of dudes probably just went along with whatever she said because she’s attractive ",
                "time": "2年前"
            },
            {
                "text": "Chinese medicine: telling you to eat healthy for a fee",
                "time": "1年前"
            },
            {
                "text": "Heat based cold? What are you talking about - SMH.",
                "time": "4年前"
            },
            {
                "text": "0:22",
                "time": "2年前"
            },
            {
                "text": "2 minutes of pure mumbo jumbo and woo-woo.",
                "time": "3年前"
            },
            {
                "text": "Two minutes of mumble jumble. Way to go, pseudoscientists!",
                "time": "4个月前"
            },
            {
                "text": "stop using endangered animal's body parts as medicine",
                "time": "1年前"
            },
            {
                "text": "Man these comments are pretty hateful and ignorant.",
                "time": "1个月前"
            }
        ],
        "video": "S-NW_L-rhNA"
    }
,
    {
        "comment": [
            {
                "text": "as a Chinese, i have great interest in TCM and its theory behind, i feel so happy to see this video and amazed by how he understands it comprehensively. Thanks for sharing this knowledge to us. also i find the more i learn about TCM, the more amazing reflections i could find through my daily life. i benefit from its theory and really want this thing being known by more people, it's beneficial for human's health, so i would feel really sad when seeing people struggling from disease or pain but have no effective treatments.",
                "time": "3年前（修改过）"
            },
            {
                "text": "What an incredible talk. As a somatic therapist grounded in yoga and qi gong practice this was superb. Incredibly illuminating. Thank you ",
                "time": "2个月前"
            },
            {
                "text": "One of the best introductions to Chinese medicine. ",
                "time": "2年前"
            },
            {
                "text": "A Beautiful Lecture ! Thank you ",
                "time": "1年前"
            },
            {
                "text": "This talk really resonated with me. Thank you for reminding me where I came from. Much Love Louise Xx",
                "time": "2年前"
            },
            {
                "text": "Absolutely amazing. I could go for another 2 hours!",
                "time": "1年前"
            },
            {
                "text": "Brilliant. So up my street. Thank you for making this lecture/talk public. Much appreciated",
                "time": "3个月前"
            },
            {
                "text": "Pro happiness! Excellent lecture. Thank you.",
                "time": "8个月前"
            },
            {
                "text": "Very well presented. Thank you",
                "time": "2年前"
            },
            {
                "text": "7:01",
                "time": "1年前"
            },
            {
                "text": "Love this.  Thank you!",
                "time": "8个月前"
            },
            {
                "text": "brilliant! Thank you for sharing.",
                "time": "1年前"
            },
            {
                "text": "Very insightful.",
                "time": "2个月前"
            },
            {
                "text": "Love it! Thank you!",
                "time": "1年前"
            },
            {
                "text": "Loved it, it was very interesting, Thank you.",
                "time": "1年前"
            },
            {
                "text": "Wonderful presentation ",
                "time": "3年前"
            },
            {
                "text": "Great talk!!! Thank you very much!!!",
                "time": "2年前"
            },
            {
                "text": "The truth is plain to see.....love your stuff kick on love it",
                "time": "3个月前"
            },
            {
                "text": "Brilliant thanks so much ",
                "time": "2个月前"
            },
            {
                "text": "Wonderful , thank you",
                "time": "4个月前"
            }
        ],
        "video": "OqchVZuy0UE"
    }
,
    {
        "comment": [
            {
                "text": "He is in a great position now as a well trained scientist. Wish the best of his career. Would  love to see what he can achieve.",
                "time": "1年前"
            },
            {
                "text": "I can sit and listen and learn about herbs all day and never get tired of it.  Someday I will go back to school to learn herbal medicine ",
                "time": "1年前"
            },
            {
                "text": "Remember the movie ( save the private Ryan) ? After the company broke through the German 1st line of defense on Normandy the Sargent started to collect the  dirt . The Philosophy is the different dirt grows different  life. After the life is formed, the local material is the best support for that life form.",
                "time": "3个月前"
            },
            {
                "text": "Love this video. Thank you for sharing!!",
                "time": "2个月前"
            },
            {
                "text": "I enjoyed the film! Very informative.",
                "time": "3年前（修改过）"
            },
            {
                "text": "I'm a firm believer in lifestyle medicine. Western medicine has its place. But only when everything else fails.",
                "time": "1个月前"
            },
            {
                "text": "More respect TCM,.,...goes to root of problem.  doesn't force one to. Comply ",
                "time": "10个月前"
            },
            {
                "text": "Gratitude and Thank You Dr.Jing - Ke Weng, I am a Mega Fan of Natural Immunity and the use of organic Traditional Chinese Medicinal Applications and ask you and the team of compassionate and astute professionals to Please consider Natto kinese, an Ancient Fermented Soya bean breakfast cereal as",
                "time": "2个月前"
            },
            {
                "text": "you need to become enlighten to understand the  real power  Behind Traditional Chinese Medicine",
                "time": "2年前"
            },
            {
                "text": "I love this guy",
                "time": "1年前"
            },
            {
                "text": "it's a lifestyle. Qi and acupuncture are amazing. How do you harness QI to cure? LOLs. Tua Na and gua sha also work. Moxi and electro acupuncture too. Lots of mysteries of being chinese. Sickness comes from when you out of balance. Plus the main cause of sickness is what we eat and stress.",
                "time": "3年前（修改过）"
            },
            {
                "text": "TCM is not limited to plants!",
                "time": "4个月前"
            },
            {
                "text": "IMHO, the practice of TCM that includes the use of donkey hide, Rhino horn, tiger bone, Pangolin scales, etc do far more harm than good to the Chinese people, not to mention the immeasurable damage to China's image, as it subject the nation to unwanted condemnation and ridicule. The true TCM scientists should dedicate their efforts to debunk such practice through the social media and put a stop to it.",
                "time": "3年前"
            },
            {
                "text": "I respectfully disagree, people dying from aids and cancer are not refusing to take Chinese medicine because of cultural reasons. They would take anything and everything to save their lives.",
                "time": "3年前"
            },
            {
                "text": "In my opinion, listening to him talk about the history and his early childhood experience with Chinese medicine, he clearly has a vested interest in believing that it works that undermines his scientific credibility, as he would obviously be biased to find interpretations of the data that suggest that Chinese medicine is effective.",
                "time": "4个月前"
            },
            {
                "text": "Everything he says about TCM is well and good but problem is that lab is not practicing our researching TCM they are degrading it by violating its most basic principle of the synergistic effect of the element's of the plants and the application to the whole person.  I was shocked, when at ",
                "time": "1年前"
            },
            {
                "text": "I like this information to help out people is very good",
                "time": "2年前"
            },
            {
                "text": "You are wrong that Chinese medicine has 5000 years of experience, because China only has 3500 years of documented civilization. Chinese medicine is a culture of China, it’s not reasonable for a well trained scientist to accept it without question it. Chinese medicine based on experience and not based on systematic science Thought it works sometimes. But it’s a very good idea to find the science behind the working ones like the healing of power of Taichi practice.",
                "time": "3个月前"
            },
            {
                "text": "Excellent ",
                "time": "3年前"
            }
        ],
        "video": "XX369fVKWOw"
    }
,
    {
        "comment": [
            {
                "text": "My nephew's urticaria was 100% cured by TCM(Tradtional Chinese Medicine). He's been cured of it for 3 years now. From what I've read of conventional western medical treatment of urticaria, they would have him on daily Zyrtec pills. In a few years it would fail, then he would take monthly Xolair shots, then that would fail and he would end up in ER and given Prednisone steroid shots, but that would eventually fail too. I'm so glad we tried TCM. It only took two months and only $170 with TCM.",
                "time": "7个月前"
            },
            {
                "text": "I was skeptical of Chinese medicine before my sister convinced me to try Unflame Herbal. Since using it, my awful back pain has almost completely been gone. I decided to look more into the effects of Chinese medicine so thank you for the info!",
                "time": "1年前"
            },
            {
                "text": "Thank you for your openness Rachel!!!  TCM really deserves an entire episodic TV series though.  It’s too broad for the scope of just one segment.  Especially in light of the key role it is playing in the treatment of COVID19 in China.",
                "time": "2年前"
            },
            {
                "text": "Being recommended to Dr Mados on YouTube was a blessing after years of suffering I have finally been cured, thanks doc God bless you..",
                "time": "11个月前"
            },
            {
                "text": "I was absolutely delighted with the immediate healing I got through Dr Mados on YouTube. Keeping saving lives doctor",
                "time": "11个月前"
            },
            {
                "text": "So, how powerful tcm is ?I can tell you.",
                "time": "2年前"
            },
            {
                "text": "It was a miracle when the doctor told me that my HSV-2 result is negative.I went to different places to get the cure but there was none. am still in shock thanks ",
                "time": "4个月前"
            },
            {
                "text": "Thank you Dr AGUNU on YouTube for being the reason why am smiling today, your herbal supplements sir are indeed very effective. Keep saving lives sir",
                "time": "6个月前"
            },
            {
                "text": "I agree with you! ",
                "time": "1年前"
            },
            {
                "text": "Thank you so much from the bottom of my heart DR OZA from Africa, 16 months old with your  treatment haven't seen any recocurrene. Herbs is great to be known.thank you doc.",
                "time": "4个月前"
            },
            {
                "text": "Herbs go a long way I'm grateful to Dr Usman his Herbal center has helpful in so many diversified way.",
                "time": "7个月前"
            },
            {
                "text": "Great experience doc, you are a godsent dr Ebhariagbe on YouTube, keep up the good work, I am completely free from HSV2  .",
                "time": "10个月前"
            },
            {
                "text": "hi . i love this content! :) Chinese are really brilliant when it comes to Natural, Organic alternative medicine",
                "time": "1年前"
            },
            {
                "text": "Thanks to dr Oluta on YouTube for his great work he has done for me in many ways about my health.",
                "time": "9个月前"
            },
            {
                "text": "Look how serious n professional he looks thats the look I'm going for n it's like a grocery store list",
                "time": "2年前"
            },
            {
                "text": "Love you Rachel!",
                "time": "5个月前"
            }
        ],
        "video": "SnuYD9_nrD4"
    }
,
    {
        "comment": [
            {
                "text": "I'm not Chinese neither have I had the opportunity to go to China but watching this just brought me to a peaceful state. I hope one day such powerful teachers of medicinal plants and spiritual healing will find us all in our journey home.",
                "time": "4个月前"
            },
            {
                "text": "As a Chi Gong practitioner, I must say that although the traditional Chinese medical culture may seem a bit metaphysical to some foreigners, it is very effective in solving diseases (especially some diseases that modern medicine cannot solve). Especially Zhan Zhuang, if you meet a good master, the effect of Zhan Zhuang is even stronger than sitting meditation",
                "time": "2周前"
            },
            {
                "text": "I am trained in Chinese medicine, but not nearly as much as the doctors who work in China. I have been to China twice and practiced in three different hospitals. It is amazingly fascinating to see how they work and the result is absolutely fantastic. It is distressing when you meet, e.g. Swedes, who think it's just a placebo, or some other hocus pocus explanation. I mean this is in harmony with nature's healing.",
                "time": "3个月前"
            },
            {
                "text": "Wow this Documentary unlocked a whole memory from my childhood. When I was around 6 or 7 I had a huge bloated stomach at all times and up to that point had been that way my whole life.  My parents couldn't figure it out....doctors said it was lactose intolerance...so my parents made adjustments to my diet and still my stomach was bloated.  I remember finally my dad took me to a TCM doctor, really strange when I think back on it as this was not something my dad was likely to do.",
                "time": "11天前"
            },
            {
                "text": "what a beautiful country China is...i have always admired the ancient beauty of China....i don't why I'm so attracted to Chinese traditional music...it's like a lullaby to my soul, it's like a heavenly mist that comforts my soul and I'm so at peace every time i hear Chinese traditional music, especially the very old or ancient songs...i love those majestic foggy towering mountains...it's like a home to my restless heart and soul...i have always wanted to live on top of a high mountain and touch the clouds and feel the soft sun rays nearer...i wish to live like a hermit or with few people in a community surrounded by vast nature and all the abundance of Mother nature's providence...",
                "time": "4个月前（修改过）"
            },
            {
                "text": "i really love how the chinese maintain the traditional medicine.  i really hope they continue to tap in more in that area.",
                "time": "1个月前"
            },
            {
                "text": "I am a Massage Therapist.  I was introduced to TCM when I trained for my profession.  Accupuncture and Chine Herbal Medicine in TCM SAVED my life.  I pray that more people discover its benefit and that it lives on FOREVER.",
                "time": "8天前（修改过）"
            },
            {
                "text": "I have a strong reason to say this... I LOVE THEM ALL AND LOVE CHINA AS ITS CULTURE AND TRADITIONS most of which are still kept and practiced today. Why do I say this?... Because I have been living in China since 2012, and my very first city I was Blessed to arrive when I met my beautiful girlfriend, it's the most ancient and beautiful first Capital of China, Luoyang City in Henan Province. And my father-in-law. Mr. Zhou Ji is an old ancient Acupuncture Doctor, still practicing and giving thousand of free treatments to most people in his city and neighboring villages. Blessings are with everyone.",
                "time": "2个月前"
            },
            {
                "text": "This makes me miss my first years in China. Much simpler times, happier and peaceful. Things changed so much since :(",
                "time": "2个月前"
            },
            {
                "text": "I have to comment though I am not done watching the entire video. I just am 18 minutes in at the hospital in Beijing and I could literally feel the difference between the western hospital and the small village doctors etc. I am a firm believer in Chi/Energy/Prana/Vibration. And it does make a HUGE difference.  Now, I am going back to watch the video.",
                "time": "3个月前"
            },
            {
                "text": "I love this kind of documentary. Love to read books and always fascinated the history about Chinese acupuncture, taichi, ching gong, medicinal plants and herbs. Thank you.",
                "time": "3个月前"
            },
            {
                "text": "Very cool. I had my own profound experiences of acupuncture over forty years ago. Now I do my humble best to share with others what I've learned. I recommend everyone study and practice chi-kung,  not just for eight months, but every day for life. It is beneficial for all ailments, but the patient must practice chi-kung as well. It is as close to a panacea as you will ever find. The patient must take an active interest in not continuing those bad habits which cause an imbalance of the chi in the first place. Find balance in your life and be well.",
                "time": "1个月前"
            },
            {
                "text": "I had 10 sessions of acupuncture to release and heal a frozen shoulder and I did not feel any pain at all when the needles went in. There was a tingling sensation but it was not pain. There was only one point, by my knee, that I had to ask for the needle to be removed. It was not painful but the sensation was very unpleasant. The doctor agreed that it was a very 'strong' point and she removed the needle for me. The rest of the points were in the hand, arm and upper back and they were no problem at all. She also gave me a brisk massage with a special alcohol rub with herbs in and I had to take some herbal pills for a few weeks. The treatment cured the problem.",
                "time": "3个月前"
            },
            {
                "text": "I've used it for many years and it is very effective in terms of remedy. This was a fascinating documentary.",
                "time": "3天前"
            },
            {
                "text": "I have trained in Medical Chi Gong) Qi Gong at traditional Beijing hospital.  Also traveled to Manila , Philippines to study Pranic Healing. As well as having studied Reiki etc in Europe.  I do most of my own healing. James J in Limerick city,  Ireland.",
                "time": "6个月前"
            },
            {
                "text": "It’s a female complaint, but your husband has to take it, too! Wow that’s an interesting diagnosis, like uti from std. He was very discreet. I wonder if practicing Chinese Medicine is always this mysterious. Unlike western doctors they will tell you exactly the terms and conditions clearly, which is more embarrassing sometimes. I appreciate both approaches now that I’m ready to learn more about healing. Thanks to YouTube creators like this one.",
                "time": "4个月前"
            },
            {
                "text": "I find this documentary amazing.  There´s so much we westerners can learn from the people of China.   I have recently started learning chi gong and this makes me want to keep doing it for a long time.",
                "time": "2个月前"
            },
            {
                "text": "Thank you. Every tribe on Earth has their medicinal plants. Combined we do not even need pharmaceuticals. Cancer, epilepsy, pain,  can all be cured or great relief from symptoms. Many illnesses can be cured. We need to gather all the knowledge of all the worlds plants and put them together in one book.",
                "time": "3个月前"
            },
            {
                "text": "Me fascina,apasiona, algo inalcansable MTC, desde hace 30 años sigo una filosofia que algun dia me conducira a profundizar el arte antiguo de salud integral holistico. China es mi guia shiatsu, moxibustion y otros, son mis armas por el mundo que me otorga la oportunidad de aprender pars crecer mis conocimientos asi poder dar bienestar a las personas y lugares que me albergan.  Gracias por tu enseñanza",
                "time": "4个月前"
            },
            {
                "text": "Chinese medicine saved me when no western medicine or doctors could- including Mayo clinic. the body is so capable if you just supplement and pay attention to the energy blocks. you find out that stuff is real when you've no other option.",
                "time": "2个月前"
            }
        ],
        "video": "XAq-Y_R_0Ic"
    }
,
    {
        "comment": [],
        "video": "S7oGWB43IlQ"
    }
,
    {
        "comment": [],
        "video": "7xQx2jsJUDM"
    }
,
    {
        "comment": [
            {
                "text": "Thank you for sharing your experience with us. Great documentary! Im 59 and through a recent series of life’s lessons I have found this hunger to learn natural medicine and healing.",
                "time": "4个月前"
            },
            {
                "text": "Watched the whole thing. Man do I ever wish getting treatment from a person like this was possible where I'm from.",
                "time": "3年前"
            },
            {
                "text": "Just watched this beautiful documentary for my alternative medicine class it was nice to see different types of traditional medicines.",
                "time": "8个月前"
            },
            {
                "text": "It's amazing to see the difference between old school TCM practice to today's....modern approach",
                "time": "4个月前"
            },
            {
                "text": "That was beautiful to watch. Thank you so much!",
                "time": "3个月前"
            },
            {
                "text": "Thank you for your amazing documentary ",
                "time": "3个月前"
            },
            {
                "text": "Well done ",
                "time": "3个月前"
            },
            {
                "text": "GOD bless you very much my brother.",
                "time": "4个月前"
            },
            {
                "text": "Would appreciate someone translate all the herbal medicine to English",
                "time": "2个月前"
            },
            {
                "text": "do you speak Chinese? that must be of great help. ",
                "time": "10天前"
            },
            {
                "text": "To discover the root of real medicine in China and to think it likely also existed here in North America.  Dr. Cunningham's journey should be on every AMA medical student's syllabus, after the 1-year of required Chinese medicine studies.  ",
                "time": "4个月前"
            },
            {
                "text": "Awesome stuff. I think I met him ;)",
                "time": "3年前"
            },
            {
                "text": "I really was touched deeply by this story, thankyou.  May I wish you all the very best ",
                "time": "4个月前"
            },
            {
                "text": "3k views? This is a treasure.",
                "time": "3个月前"
            },
            {
                "text": "One of the most beautiful films I have seen in a very long time. Xie Xie",
                "time": "1个月前"
            },
            {
                "text": "Only 11k views? Shame on these Algorithms.",
                "time": "1个月前"
            },
            {
                "text": "you'll see this stuff at american chinatowns.",
                "time": "3年前（修改过）"
            }
        ],
        "video": "pSValV_G84w"
    }
]