[
            {
                "text": "another crucial aspect of the BRI is, is that it connects all of these countries by roads and ports - not just connect it to China. That is essentially what the ancient Silk Road was - a connection between the myriad countries where it ran. It brought prosperity to all. Especially China but not because the 'roads and ports all lead to China' but because it was a gigantic economy even back then"
            },
            {
                "text": "To my surprise, AJ is indeed capable of shedding a fair spotlight on China in this regard. A lot less like the typical Western media."
            },
            {
                "text": "I like the conclusion: the competition between China and the West to provide infrastructure to developing nations will likely be good for the developing nations. These countries need infrastructure more than they need ideological purity. If big nations want to compete to provide that infrastructure, all the better!"
            },
            {
                "text": "Something I've witnessed in Thailand , a humongous highway structure was being built on a main route heading south from the north east, great round pillars maybe 40mtrs or more high , with equipment like some thing from a thunderbird film , sliding great sections of road , from pillars to pillars , amazing .."
            },
            {
                "text": "The host lady is conducting the show in a sound professional manner, throwing ample light on the pros and cons of the Chinese development initiatives covering the African continent to the Gaweder in Pakistan. To help the poor and impoverished nations every single step taken by China is admirable. Poor wants to bring bread on the table."
            },
            {
                "text": "This is called real reporting about BRI..... unbiased."
            },
            {
                "text": "The BRI is an umbrella initiative spanning a multitude of projects designed to promote the flow of goods, investment, and people. The new connections fostered by the BRI could reconfigure relationships, reroute economic activity, and shift power within and between states."
            },
            {
                "text": "I honestly can't see the US or any European nations doing this in any country without China starting First."
            },
            {
                "text": "Comparing China and America... Two of the most technologically advanced super powers; one has thousands of military bases in other poor countries, and one has built thousands of miles roads and homes in other poor countries. I wouldn’t choose more foreigners military bases in my city and staying poor."
            },
            {
                "text": "This is the only objective report I've found on the BRI. Allow developing countries to make their own decisions. Having China or the West decide for them is merely another type of colonialism."
            },
            {
                "text": "The relief is: Maybe the Developing countries will benefit in this competition"
            },
            {
                "text": "I live in NYC and I can confidently say that infrastructure here and most other cities in the US is crumbling. Why would anyone look at us for infrastructure projects?"
            },
            {
                "text": "I read that about that Sri Lanka port, the loan was restructured dozens of times before they decide the 99year lease is best option"
            },
            {
                "text": "BRI has evolved into a vision participating nations can achieve together, foster further collaboration between Asia and Europe."
            },
            {
                "text": "At least the infrastructures are there, and  it is up the people to strive for"
            },
            {
                "text": "This was a really great analysis of the Belt & Road Initiative from several perspectives. Thank you!"
            },
            {
                "text": "Very informative. China’s Belt & Road is of course meant to increase China’s global influence. It comes with conditions but why do we think that IMF and World Bank conditions is any less severe on less developed countries &/or they are not equally prone to corruption?"
            },
            {
                "text": "Missing the fact that China also use this project to study health care and diseases along the way so it is not just transportation but for them to learn and be better prepared health care system."
            },
            {
                "text": "Maybe 6 years ago I saw the highway built with Chinese funds in Ethiopia. These massive projects and the will to do them is impressive. America is still doing environmental analysis on the keystone pipeline and mulling it over."
            },
            {
                "text": "What a great idea "
            },

            {
                "text": "I literally laughed at her last statement :\" what started as one belt one road  is now one belt to many road blocks.\" savage Palki."
            },
            {
                "text": "The contents on this channel is amazing. "
            },
            {
                "text": "Amazing news reportage, and Palki is definitely the epitome of how an ideal journalist should be like. Absolutely loved this video and WION's content is always so rich!"
            },
            {
                "text": "With the monopolization of news and media in the United States, I find such thorough reporting wonderful. By facts over rhetoric I find this both informative and entertaining."
            },
            {
                "text": "from Canada: i love your reporting and i thank you for it. you are reinforcing what those of us in the west, despite our education and access to information, refuse to report on or consider what it all means for our collective future."
            },
            {
                "text": "\"Power tends to corrupt; absolute power corrupts absolutely\" - Lord Acton"
            },
            {
                "text": "\"One belt, many roadblocks\" Palki you are a 'wordsmith' unparalleled . Excellent reporting as usual.  But you did not mention our human natures. Aggrieved peoples eventually find a way/s to defeat their oppressors. CCP obviously are not historical scholars, look at what happened to the British Empire ; the United States fought and got independence as did Gandhi for India. A model I forsee for the CCP is the Mau Mau rebellion in Kenya - a violent whiplash of emotions directed to the British colonials. There are many more examples of colonial powers being overthrown by their downtrodden subjects. \"To be born free is an accident. To live free a responsibility. To die free is an obligation\" Anonymous."
            },
            {
                "text": "Never seen such information with plenty of research done by this team. Kudos to you. Keep up the good work."
            },
            {
                "text": "I love this channel. recently, I started watch this channel. I love the palki mam traditional indian culture and easily speaks English fluency pronounciation charming and understood very easily... It will be very helpful for me... This channel is very much better rather than other news channels....jai hind"
            },
            {
                "text": "\"Mrs. Palki Sharma's\" work is needed to be appreciated, within a span of a month, I am able to understand the geopolitics at least around India and in some parts of the world. Thanks to WION and CRUX, optimal and crisp news."
            },
            {
                "text": "Shockingly Italy was the first European nation to sign on with China. The environmental damage done through these projects is devastating. Please talk about that. Great reporting thank you."
            },
            {
                "text": "I can just imagine how proud Palki's parent will be of such an absolute amazing person she became. What a breathe of fresh air watching this channel. Amazing journalism. Keep it up . The world world is watching you now."
            },
            {
                "text": "À wonderfully erudite young woman.  Clear, understandable explanation of a complex subject.  We here in the Pacific have numerous examples of island nations indebtedness to China’s so called benevolent development aid.  This program should be on all school curriculum to educate our kids about what is really happening."
            },
            {
                "text": "Why didn't I discovered this news channel earlier?? You guys are doing an amazing job by not putting shit into people's head like most of the mainstream media is doing. Just please stick to it. "
            },
            {
                "text": "This is what we call journalism. Thanks for the in-depth analysis."
            },
            {
                "text": "The US is playing Call of Duty, while China is playing CIVILIZATION"
            },
            {
                "text": "BRILLIANT! I understand now completely - excellent report I have downloaded and will use it in my classes. You have done every one who does not want to live as slaves under China supported by the Tech Elite a huge service"
            },
            {
                "text": "I love Gravitas and the reporter here. She is unafraid to take on any tough issue. Best reporting on the internet."
            },
            {
                "text": "As usual, you're immaculate in your analysis and surgical precision in your presentation. So far, I haven't heard any journalist with such a precision. Hats off to your journalism and presentation Ms. Palki... Please keep up the good work. You're awesome"
            },
            {
                "text": "We got to make this channel popular. I'm sick of biased Western media."
            },

            {
                "text": "Thanks as always for watching :D See new videos early, participate in exclusive Q&As, and more!\r"
            },
            {
                "text": "You left out an important political aspect. China imports and exports a lot of material and products by sea but the problem with that is that those shipping lanes have to pass through or near countries that are allied with the US which makes the Chinese economy vulnerable to a naval blockade. The Belt and Road initiative can decrease the reliance of the chinese economy on those shipping lanes."
            },
            {
                "text": "I love this channel because you use logic rather than emotion to judge one's action. This is 1 of the few videos from western countries don't use fear on subject related to China."
            },
            {
                "text": "Without infrastructure poor countries remain in a Poverty Trap of stagnation. Infrastructure is the essential platform for countries to grow and modernize."
            },
            {
                "text": "It was Sri Lanka that proposed handing over control of Hambantota Port to China - it wasn't China's idea. Sri Lanka, having just lived through a Civil War, had an extremely high debt to GDP ratio too."
            },
            {
                "text": "It seems unlikely China would want the borrowers to default on their debt, as it may discourage new countries from entering the BRI and makes the existing countries wary of China's inluence. However, in certain instances, where assets of strategic importance are in play (Kenya, Mombasa) it does appear that China is glad to have gained a new foothold in the region, regardless of the bad press it may attract."
            },
            {
                "text": "Amazing analysis, just as always! Would love to see your videos on the economies of Poland and Denmark. Both were among the most interesting countries in Europe before this crisis but now, given they both seem to have been much less affected than other European nations, they might come out as even bigger players."
            },
            {
                "text": "3 general aims of the Belt and Road initiative. "
            },
            {
                "text": "There's another aspect you didn't cover in this video as it was geared primarily towards the economic component. The military and political application of these roads and ports, not necessarily for the purpose of creating invasion corridors. But, if China forecloses on a port and decides to say, I don't know station naval assets there suddenly they wield massive influence over said nation, even more so than their prior economic influence. They're quietly performing their own form of colonization in Africa as we discuss this."
            },
            {
                "text": "I would have studied economics in high schoool if my teachers had presented it such a way as you do to make it interesting. Great channel"
            },
            {
                "text": "I really appreciate the non-biased approach you take when talking about China."
            },
            {
                "text": "Belt and road initiative offers to the world a much easier access to materials and commercial goods to countries that lack infrastructure to do so.. its a win-win situation for all.. but ofc the country who is in charge for this kind mega-projects might benefit the most.. (there is no free breakfast)"
            },
            {
                "text": "This video does much to explain the economic implication of the OBOR project as a whole; I would be interested to see the same cost/benefit analysis applied to each individual development of the project on its own. The first would be the non-commercial uses of foreclosed ports, which are consistently becoming PRC overseas military bases, the most famous being the base in Djibouti by the Gulf of Aden. It would bring clarity to find the the extent to which this base stands to protect ships from piracy, versus the current cost of piracy on PRC shipping."
            },
            {
                "text": "Europe: tries to colonise china"
            },
            {
                "text": "You missed the most critical goal of China's BRI: National security.   >90% of China trade and oil import goes via sea, and China's navy is not powerful enough to protect it from US navy, so China goes west to connect to EuroAsia continent which US won't be easy to block.  All other goals are secondary."
            },
            {
                "text": "Nice Job, EE! This is quite a balanced perspective. The \"debt trap\" rhetoric portrays African leaders as somehow unable to see the risks involved in the loan arrangements. This underlying assumption reflects Western prejudices and stereotypes against Africans."
            },
            {
                "text": "it's good to see an Australian channel making objective contents from economic prospective; so much better than those politicians, or so called news website and TV shows, where they never tell you the whole story and only say what they want you to see and hear"
            },
            {
                "text": "I believe they welcome any outcome when it is related to the debts. If they pay, it's good for them, if they don't, they can make it good for them as well. I believe that to do this at this scale, you are not worried about the outcome. You focus on making it work."
            },
            {
                "text": "I liked your analysis, I would've explored the market potential in developing countries are tremendous. If these nations don't screw up internally (ie; civil war), and just grow a few % per year, their combined new found wealth in purchasing power is incalculable. "
            },
            {
                "text": "\"Nefarious\" is a relative term. You are right that this is mostly a economic endeavor aimed at creating a economic sphere revolving around China, and that definitely ruffles feathers in Moscow, Washington, and New Delhi. However, there are some relatively minor strings attached as always. China has a habit of placing punitive economic measures on nations that aggravate them, again nothing unique there. What I and others what to know is \"does the economic sphere lead to military interventionism?\": history and current events point to yes but we don't know."
            },

            {
                "text": "\"Critics argue this will enhance China's geopolitical influence.\""
            },
            {
                "text": "Nice video, simple and accurate. No biased and excessive content."
            },
            {
                "text": "The most interesting component is the arctic Silk Road, linking China Russia and Scandinavia"
            },
            {
                "text": "Actually, there's a huge geographic benefit since Europe, Africa, and Asia are next to each other, also connected by land. It could be easier to expand trade route and others. "
            },
            {
                "text": "By no means are we (United States) wary of China's growing influence. That's what free enterprise does. In fact, we encourage it and we're not concerned about our standing. We do have concerns about them counterfeiting our products after they steal our technology but we wish china well and all we want is fair trade. No shame in that. Then both countries can grow & prosper."
            },
            {
                "text": "Finally we have another superpower. No more 1 country dominates all. Having 2 buyers are better than one."
            },
            {
                "text": "Great enterprise.. Love from Bangladesh..."
            },
            {
                "text": "You may wish to track and trace back to your superiors when and whom plus how the idea came up back in 2012. After being thought up in 2010 by the game Silkroad Online. But among is the idea to end poverty and war in Africa. We thought that war wasn't the way for global economy since everyone wants to profit and benefit. So the obvious solution was to raise the welfare of the continent. Now you know. This message was relayed by authorities and they get the credit. Whereas the original person who came up with the idea is hidden close and tightly wrapped up. Nothing, not a single credit goes to him. In fact, they covered everything up and make sure he looked mentally ill."
            },
            {
                "text": "Does anyone have any sources for the evidence placed above"
            },
            {
                "text": "this is objective. It’s fact that some  countries are arguing about the BRI since the risk comes with opportunity. While it's a worth game to play"
            },
            {
                "text": "While I heard the United Kingdom and Germany have signed at the end of last year."
            },
            {
                "text": "thank you Mr.Mike"
            },
            {
                "text": "they are essentially repeating USSR's expansion to sieria and central asia....it ultimately bankrupted them with little to no benefit. the thing about sea is that you can scale up very easily to carry different loads and take different routes. you can't do this with land based transportation, so there is tremendous upfront cost to build infrastructures in countries with little to no benefit to China."
            },
            {
                "text": "Belt to tighten the debt for country under the planning road for $$$ better not join this belt buckle trapped "
            },
            {
                "text": "one ring to rule them all.... one road to make conquest easier."
            },
            {
                "text": "I can’t tell if this video is biased to not, but it seems very neutral"
            },
            {
                "text": "You have to face a lot china..."
            },

            {
                "text": "The US is playing Call of Duty, while China is playing CIVILIZATION"
            },
            {
                "text": "\"Hide Your Strengths and Bite Your Time\" - very wise words for a national leader, who is clearly playing the long game."
            },
            {
                "text": "This reminds me of a book I've read called \"Proxima\" by Stephen Baxter. The synopsis of the book is that during the 22nd century, China is the largest economic superpower with the \"Chinese Economic Framework\" foreign policy described in the book. It also takes place in a time where they were the first country to put a man on Mars and have a near monopoly  on the solar system, spanning from Earth's orbit,Mars, the Asteroid Belt,and Jupiter. "
            },
            {
                "text": "CNBC, please give Xin En some funding, so she can travel around the world like other presenters. It's not fair to her that other presenters can travel but she has to stay in Singapore"
            },
            {
                "text": "Building infrastructure is generally good..."
            },
            {
                "text": "I think the Belt & Road is a great idea, it’s very important for this project to be transparent for the citizens of the nations involved."
            },
            {
                "text": "Great reporting. I found the information very informative thus provided in this video."
            },
            {
                "text": "A little check and balance is fine, but China is helping their economy in the longer run for sure. It is a win-win, you can't lose on building roads. Roads allow development and trade."
            },
            {
                "text": "Perhaps China could pursue its military intentions in other ports, but not Hambantota. Sri Lanka specifically negotiated that it was not to be used for military purposes."
            },
            {
                "text": "I really appreciate this video! This is truly good and truthful!"
            },
            {
                "text": "Anyone know where Xin En Lee went? All her social media has been inactive for a few years. She's such a great host and really enjoy her presentations. Hopes she's doing well "
            },
            {
                "text": "Very very well explained"
            },
            {
                "text": "Since the general aim for every human on earth is to grow and infrastructure and trade are the primary means for any kind of growth, I find it a net good deal considering all possible pros and cons it could bring to everyone."
            },
            {
                "text": "They learned their lessons very well"
            },
            {
                "text": "tweet:  Thanks for delineating in bits and pieces the belt and road initiative programs."
            },
            {
                "text": "I believe that time will tell if the benefits outweigh the losses for those countries."
            },
            {
                "text": "Please make a series of videos on following:"
            },
            {
                "text": "Given china is mainly a export oriented economy, China feels strongly that it needs a secure and diversified trading routes which  it lacks now and it current trading route can be easily cut off by the US especially in areas like the south china sea and Singapore straits in event there is any trade or oil embargo impose on China. So this really explain why China desperately wants to create new alternative trading routes through the one belt one road to improve connectivity between countries so that it will be able to safely transport its good across."
            },
            {
                "text": "2:06"
            },
            {
                "text": "China needs to leverage a long term approach. Trade routes need to be economic to make economic sense."
            },

            {
                "text": ":_rocketship:"
            },
            {
                "text": "“Hire Chinese workers who ultimately take wages home.” It’s the small things that matter folks"
            },
            {
                "text": "\"The US decided the port would not be economically viable...\""
            },
            {
                "text": "Pakistan owes the world 239 billion dollars, and Chinese money is only 25% of it. Considering that the debt is used to build critical infrastructure, the CPEC project is essential to Pakistan. And why does no one talks about the other 75% debt "
            },
            {
                "text": "China gets to use their excess labor, state-owned enterprise capacity, and keep strategic allies indebted to them. The leaders of the target country get to tout achievements and are paid under the table. The general population gets desperately needed infrastructure. It's a win-win-win strategy. I'm not implying China cares about the target country, but why would/should they?"
            },
            {
                "text": "The freedom of navigation is the primary reason why trade can rely on this for goods to be reliably exchanged globally. Can land route achieved the same kind of freedom of movement? During times of peace, I think it may still be possible but it is still challenging. Without international law governing the freedom of movement of goods via land route, any country can simply impose unilateral border control measures."
            },
            {
                "text": "China building road for themselves and charging the bill for it as loan to Pakistan "
            },
            {
                "text": "Hilarious that at "
            },
            {
                "text": "With the kind of leaders pakistan has, and it's never ending dependency to rely on others, it will always remain a stooge of other super powers."
            },
            {
                "text": "so the road is the belt and the sea is the road."
            },
            {
                "text": "Pakistan PM :\"Our economy now linked to china \"this is the big statement . Pakistan on   the way to srilanka  ."
            },
            {
                "text": "The main challenge is the slow-paced bureaucracy and lack of transparency within Pakistan."
            },
            {
                "text": "To all nations, don't compromise your value."
            },
            {
                "text": "Idea is to belt Pakistan on the Road. (That's the whole belt and road initiative)"
            },
            {
                "text": "An interesting analysis, it will be interesting to see how these projects play out in the future. Because regardless of who eventually takes over (if any1), if its a commercial dud then its going to be a problem no matter who the owner is."
            },
            {
                "text": "Shipping in their own workers then building them housing that keeps them separate. Locals can apply to be the janitor or checkpoint security I expect. Maybe not even security, not with CCP management."
            },
            {
                "text": "Very impressive port."
            },
            {
                "text": "rule no. 1: don't mess with the Fisherman in the area. It leads to delayed projects worldwide, f.e. in Jakarta"
            },
            {
                "text": "China's Belt and Road initiative has left many financially weak countries trapped in \"secret debt\".  It is claimed that China owes  36.5 billion to these countries. China has invested a total of, 64.3 billion in roads, bridges, ports and hospitals in 173 countries. These countries include many countries in Africa and Central Asia.\r"
            },
            {
                "text": "Great video, but no mention of the fact that contractors are asking to be paid in dollar "
            },

            {
                "text": "This is one of the best summaries of the BRI that I have seen on YouTube so far.  I hope this one gets around and helps people understand what China's motives are when they come offering money and help.  Like a trojan horse, the deals are loaded with dangerous fine print traps.  Every one of those poor countries who fell for the Belt an Road Initiative will pay and pay, slowing down their progress for the future. Great work, Mint!"
            },
            {
                "text": "The best alternative is the BRI . Genius & wisdom !"
            },
            {
                "text": "It is fairly common senses, no body will give you anything FREE, there is always some form of"
            },
            {
                "text": "Good...."
            },
            {
                "text": "You can conquer a nation 2 ways 1. By sword 2. By debt. US president words."
            },
            {
                "text": "hello reporter ,be honest  not talking in half truth,the year 2020 is covid year most investment had slowed down during covid years"
            },
            {
                "text": "Why would you say that "
            },
            {
                "text": "Please  please close yr gap. Kindly view at a more positive lens instead of spewing toxic rethrotic of China's $$$ Trillion failure. Isn't belt n road beneficial to people n country for connectivity n promote access to trade n industries particularly to developing Countries ? Do U not think China's mission is on shared prosperity where she put her words where her mouth is ? "
            },
            {
                "text": "Sir, are you speaking Indian? Or a combination of English and Indian? It sounds like you are chewing something."
            },
            {
                "text": "The background music is off putting"
            },
            {
                "text": "Mint: Your lies are your chain! Enjoy!"
            },
            {
                "text": "High inerest rate? Indian jealousy really have no limit"
            },
            {
                "text": "No"
            },
            {
                "text": "Endians forever jealous of China's Success..Gwadar port will be another  jewel of the gulf in  of commerce and trade"
            },
            {
                "text": "The more india talk, the more it exposes  pure jealousy."
            },
            {
                "text": "Bulls**t"
            },

            {
                "text": "Africa is very well aware of Western and EU imperialism, as an African we already have China and Russia helping us and we has seen how much China and Russia has helped us improved in infrastructure. As an South African and we as Africans are not going to push China and Russia aside."
            },
            {
                "text": "How astonishingly different the tone and language employed by the western bloc and the Global South sound to me: the former are incessantly talking about threats, adversaries, containment, whereas the latter talk about development, cooperation, self-determination. My sympathy is all for the latter, as they remain the only hope for humanity as a whole."
            },
            {
                "text": "I am a Malawian. I have never witnessed any kind of infrastructure from the western countries. China helped constructing several infrastructures"
            },
            {
                "text": "They hoped the belt would fail so that African nations would not develop. Now they feel compelled to participate because they have lost hope of the gelt failing so they want to get involved to disrupt operations, but their aim and hopes will be the same so they hope by getting involved they can slow down or disrupt Africa's development, from the inside so to speak. Peace and love."
            },
            {
                "text": "I'm a 60 year old Australian, as a kid in the 1970's I watched the TV ad's showing starving, underprivileged kids in Africa. Did organized fund raising marathon walks with neighborhood sponsors to raise money for this cause."
            },
            {
                "text": "China wants to push  another initiative along  with BRI called (global industrialisation initiative program) to accelerate industrial development,  and large scale industries to promote global gateway for industrialisation..🇨🇳"
            },
            {
                "text": "I think no other initiative  or project by any country can match China's Belt and Road initiative. The BRI project is the biggest project in the 21st century."
            },
            {
                "text": "We don't need investment from colonialists, it definitely has too many strings attached to it. May China out shine them all. What infrastructure has the USA ever built anywhere apart from military bases and it's embassies?"
            },
            {
                "text": "This is great... I am going to call my representative in congress and ask to have them come and help our state with infrastructure... everything from roads to bridges is falling apart."
            },
            {
                "text": "G7 lot of promise to the world but not materialise only export of turmoil around the world..while china expand  infrastructures around the globe benifet other country"
            },
            {
                "text": "Привет всем нашим азиатским соседям из России. "
            },
            {
                "text": "I love this presenter, she is spot on and these men are reasonable and wise.  I think that the developing countries can see through the G7 hypocrisy and lies because history repeats, like the man said, people are not stupid. Great reportage, so true."
            },
            {
                "text": "Every year the G7 get together to plan something that probably won't materialized but hey, it's a great photo opportunity and maybe the party afterwards are probably worth the trip. Biden's BBB and this new plan reminds me of most people's new year resolution which only last after the first week of making it. I can't wait for the next year's announcement of a new project. Looking forward to it."
            },
            {
                "text": "There is no way that G7 can compete against China!!!"
            },
            {
                "text": "the question at "
            },
            {
                "text": "G7: \"Yeah we are going to beat you at your own game!\" "
            },
            {
                "text": "Glad that such alternative news and views are made available so that the Western narratives can be judged based on the full facts."
            },
            {
                "text": "The G7 prefers to produce weapons instead of infrastructure….."
            },
            {
                "text": "Latest is that Usa has coerced UAE, Jordon, Saudi Arabia too extend NATO also to be against China. Is there no end to Americans bullying?"
            },
            {
                "text": "Bay bridge was 6 years in construction and costed 3 billion $. With that efficiency G7 hardly can any built."
            }
    ]
